TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.5.LTS *
       3              ;* Date/Time created: Wed Jan 11 17:05:06 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\jason\workspace_v10_4\MonoMtrServo_379D\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_SetupPinOptions")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_SetupPinOptions")

    1482                      ; call occurs [#_AdcSetMode] ; [] |261| 
    1483 000001cb 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         000001cc 0000 
    1484                      .dwpsn  file "../config.c",line 274,column 2,is_stmt,isa 0
    1485 000001cd 8F00          MOVL      XAR4,#39998           ; [CPU_ARAU] |274| 
         000001ce 9C3E 
    1486                      .dwpsn  file "../config.c",line 264,column 2,is_stmt,isa 0
    1487 000001cf 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0004 ; [CPU_ALU] |264| 
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   30

         000001d0 0004 
    1488 000001d1 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         000001d2 0000 
    1489                      .dwpsn  file "../config.c",line 265,column 2,is_stmt,isa 0
    1490 000001d3 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0004 ; [CPU_ALU] |265| 
         000001d4 0004 
    1491                      .dwpsn  file "../config.c",line 274,column 2,is_stmt,isa 0
    1492 000001d5 A8A9          MOVL      ACC,XAR4              ; [CPU_ALU] |274| 
    1493 000001d6 761F!         MOVW      DP,#_AdccRegs         ; [CPU_ARAU] 
         000001d7 0000 
    1494                      .dwpsn  file "../config.c",line 266,column 2,is_stmt,isa 0
    1495 000001d8 1A00!         OR        @$BLOCKED(_AdccRegs),#0x0004 ; [CPU_ALU] |266| 
         000001d9 0004 
    1496 000001da 761F!         MOVW      DP,#_AdcaRegs         ; [CPU_ARAU] 
         000001db 0000 
    1497                      .dwpsn  file "../config.c",line 269,column 2,is_stmt,isa 0
    1498 000001dc 1A00!         OR        @$BLOCKED(_AdcaRegs),#0x0080 ; [CPU_ALU] |269| 
         000001dd 0080 
    1499 000001de 761F!         MOVW      DP,#_AdcbRegs         ; [CPU_ARAU] 
         000001df 0000 
    1500                      .dwpsn  file "../config.c",line 270,column 2,is_stmt,isa 0
    1501 000001e0 1A00!         OR        @$BLOCKED(_AdcbRegs),#0x0080 ; [CPU_ALU] |270| 
         000001e1 0080 
    1502 000001e2 761F!         MOVW      DP,#_AdccRegs         ; [CPU_ARAU] 
         000001e3 0000 
    1503                      .dwpsn  file "../config.c",line 271,column 2,is_stmt,isa 0
    1504 000001e4 1A00!         OR        @$BLOCKED(_AdccRegs),#0x0080 ; [CPU_ALU] |271| 
         000001e5 0080 
    1505                      .dwpsn  file "../config.c",line 274,column 2,is_stmt,isa 0
    1506              $C$DW$111       .dwtag  DW_TAG_TI_branch
    1507                      .dwattr $C$DW$111, DW_AT_low_pc(0x00)
    1508                      .dwattr $C$DW$111, DW_AT_name("_F28x_usDelay")
    1509                      .dwattr $C$DW$111, DW_AT_TI_call
    1510              
    1511 000001e6 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |274| 
         000001e7 0000 
    1512                      ; call occurs [#_F28x_usDelay] ; [] |274| 
    1513 000001e8 761A   EDIS
    1514 000001e9 FF69          SPM       #0                    ; [CPU_ALU] 
    1515              $C$DW$112       .dwtag  DW_TAG_TI_branch
    1516                      .dwattr $C$DW$112, DW_AT_low_pc(0x00)
    1517                      .dwattr $C$DW$112, DW_AT_TI_return
    1518              
    1519 000001ea 0006          LRETR     ; [CPU_ALU] 
    1520                      ; return occurs ; [] 
    1521                      .dwattr $C$DW$107, DW_AT_TI_end_file("../config.c")
    1522                      .dwattr $C$DW$107, DW_AT_TI_end_line(0x115)
    1523                      .dwattr $C$DW$107, DW_AT_TI_end_column(0x01)
    1524                      .dwendentry
    1525                      .dwendtag $C$DW$107
    1526              
    1527              ;**************************************************************
    1528              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1529              ;**************************************************************
    1530                      .global _GPIO_SetupPinOptions
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   31

    1531                      .global _GPIO_SetupPinMux
    1532                      .global _GPIO_WritePin
    1533                      .global _DisableDog
    1534                      .global _GPIO_EnableUnbondedIOPullups
    1535                      .global _InitSysPll
    1536                      .global _InitPeripheralClocks
    1537                      .global _AdcSetMode
    1538                      .global _F28x_usDelay
    1539                      .global _AnalogSubsysRegs
    1540                      .global _AdcaRegs
    1541                      .global _AdcbRegs
    1542                      .global _AdccRegs
    1543                      .global _CpuSysRegs
    1544              
    1545              ;***************************************************************
    1546              ;* TYPE INFORMATION                                            *
    1547              ;***************************************************************
    1548              
    1549              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1550                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
    1551                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1552              $C$DW$113       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$113, DW_AT_name("BURSTTRIGSEL")
    1555                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1556                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a)
    1557                      .dwattr $C$DW$113, DW_AT_bit_size(0x06)
    1558                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1560              
    1561              $C$DW$114       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1563                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    1564                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    1565                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1566                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1567                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1569              
    1570              $C$DW$115       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1572                      .dwattr $C$DW$115, DW_AT_name("BURSTSIZE")
    1573                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BURSTSIZE")
    1574                      .dwattr $C$DW$115, DW_AT_bit_offset(0x04)
    1575                      .dwattr $C$DW$115, DW_AT_bit_size(0x04)
    1576                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1578              
    1579              $C$DW$116       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1581                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1582                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    1583                      .dwattr $C$DW$116, DW_AT_bit_offset(0x01)
    1584                      .dwattr $C$DW$116, DW_AT_bit_size(0x03)
    1585                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   32

    1586                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1587              
    1588              $C$DW$117       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$117, DW_AT_name("BURSTEN")
    1591                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_BURSTEN")
    1592                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1593                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1594                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1596              
    1597                      .dwendtag $C$DW$T$20
    1598              
    1599              
    1600              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1601                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
    1602                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1603              $C$DW$118       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1605                      .dwattr $C$DW$118, DW_AT_name("all")
    1606                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1607                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1609              
    1610              $C$DW$119       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1612                      .dwattr $C$DW$119, DW_AT_name("bit")
    1613                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1614                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1616              
    1617                      .dwendtag $C$DW$T$21
    1618              
    1619              
    1620              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1621                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
    1622                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1623              $C$DW$120       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$120, DW_AT_name("FREECOUNT")
    1626                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_FREECOUNT")
    1627                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1628                      .dwattr $C$DW$120, DW_AT_bit_size(0x0c)
    1629                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1631              
    1632              $C$DW$121       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    1635                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    1636                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1637                      .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    1638                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1640              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   33

    1641                      .dwendtag $C$DW$T$22
    1642              
    1643              
    1644              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1645                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
    1646                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1647              $C$DW$122       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$122, DW_AT_name("all")
    1650                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1651                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1653              
    1654              $C$DW$123       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$22)
    1656                      .dwattr $C$DW$123, DW_AT_name("bit")
    1657                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1658                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661                      .dwendtag $C$DW$T$23
    1662              
    1663              
    1664              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1665                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
    1666                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1667              $C$DW$124       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    1670                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    1671                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e)
    1672                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1673                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$125       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1678                      .dwattr $C$DW$125, DW_AT_name("INTPULSEPOS")
    1679                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1680                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0d)
    1681                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685              $C$DW$126       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1688                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1689                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    1690                      .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    1691                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1693              
    1694              $C$DW$127       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   34

    1696                      .dwattr $C$DW$127, DW_AT_name("ADCPWDNZ")
    1697                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1698                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1699                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1700                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$128       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$128, DW_AT_name("ADCBSYCHN")
    1706                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1707                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04)
    1708                      .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    1709                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$129       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$129, DW_AT_name("rsvd3")
    1715                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd3")
    1716                      .dwattr $C$DW$129, DW_AT_bit_offset(0x03)
    1717                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1719                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721              $C$DW$130       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$130, DW_AT_name("ADCBSY")
    1724                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCBSY")
    1725                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02)
    1726                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1727                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1729              
    1730              $C$DW$131       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$131, DW_AT_name("rsvd4")
    1733                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd4")
    1734                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1735                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1736                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739                      .dwendtag $C$DW$T$24
    1740              
    1741              
    1742              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1743                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
    1744                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1745              $C$DW$132       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1747                      .dwattr $C$DW$132, DW_AT_name("all")
    1748                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    1749                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   35

    1751              
    1752              $C$DW$133       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$24)
    1754                      .dwattr $C$DW$133, DW_AT_name("bit")
    1755                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    1756                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759                      .dwendtag $C$DW$T$25
    1760              
    1761              
    1762              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1763                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
    1764                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1765              $C$DW$134       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$134, DW_AT_name("PRESCALE")
    1768                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PRESCALE")
    1769                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1770                      .dwattr $C$DW$134, DW_AT_bit_size(0x04)
    1771                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$135       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1776                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1777                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1778                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0a)
    1779                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1780                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1782              
    1783              $C$DW$136       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$136, DW_AT_name("RESOLUTION")
    1786                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RESOLUTION")
    1787                      .dwattr $C$DW$136, DW_AT_bit_offset(0x09)
    1788                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1789                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1790                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1791              
    1792              $C$DW$137       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1794                      .dwattr $C$DW$137, DW_AT_name("SIGNALMODE")
    1795                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_SIGNALMODE")
    1796                      .dwattr $C$DW$137, DW_AT_bit_offset(0x08)
    1797                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1798                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1799                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1800              
    1801              $C$DW$138       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$138, DW_AT_name("rsvd2")
    1804                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd2")
    1805                      .dwattr $C$DW$138, DW_AT_bit_offset(0x03)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   36

    1806                      .dwattr $C$DW$138, DW_AT_bit_size(0x05)
    1807                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1809              
    1810              $C$DW$139       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1812                      .dwattr $C$DW$139, DW_AT_name("rsvd3")
    1813                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd3")
    1814                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1815                      .dwattr $C$DW$139, DW_AT_bit_size(0x03)
    1816                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1817                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1818              
    1819                      .dwendtag $C$DW$T$26
    1820              
    1821              
    1822              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1823                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
    1824                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1825              $C$DW$140       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1827                      .dwattr $C$DW$140, DW_AT_name("all")
    1828                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1829                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$141       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$26)
    1834                      .dwattr $C$DW$141, DW_AT_name("bit")
    1835                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1836                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1838              
    1839                      .dwendtag $C$DW$T$27
    1840              
    1841              
    1842              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1843                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
    1844                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1845              $C$DW$142       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1847                      .dwattr $C$DW$142, DW_AT_name("PPB1TRIPHI")
    1848                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1849                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f)
    1850                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1851                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1853              
    1854              $C$DW$143       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1856                      .dwattr $C$DW$143, DW_AT_name("PPB1TRIPLO")
    1857                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1858                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
    1859                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1860                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   37

    1861                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1862              
    1863              $C$DW$144       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1865                      .dwattr $C$DW$144, DW_AT_name("PPB1ZERO")
    1866                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PPB1ZERO")
    1867                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d)
    1868                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1869                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$145       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    1875                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    1876                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    1877                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1878                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1880              
    1881              $C$DW$146       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1883                      .dwattr $C$DW$146, DW_AT_name("PPB2TRIPHI")
    1884                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1885                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b)
    1886                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1887                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1888                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1889              
    1890              $C$DW$147       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1892                      .dwattr $C$DW$147, DW_AT_name("PPB2TRIPLO")
    1893                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1894                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a)
    1895                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1896                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1898              
    1899              $C$DW$148       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$148, DW_AT_name("PPB2ZERO")
    1902                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PPB2ZERO")
    1903                      .dwattr $C$DW$148, DW_AT_bit_offset(0x09)
    1904                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1905                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1906                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1907              
    1908              $C$DW$149       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1910                      .dwattr $C$DW$149, DW_AT_name("rsvd2")
    1911                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd2")
    1912                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08)
    1913                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1914                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   38

    1916              
    1917              $C$DW$150       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1919                      .dwattr $C$DW$150, DW_AT_name("PPB3TRIPHI")
    1920                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1921                      .dwattr $C$DW$150, DW_AT_bit_offset(0x07)
    1922                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1923                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1924                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1925              
    1926              $C$DW$151       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1928                      .dwattr $C$DW$151, DW_AT_name("PPB3TRIPLO")
    1929                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1930                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06)
    1931                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1932                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1934              
    1935              $C$DW$152       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1937                      .dwattr $C$DW$152, DW_AT_name("PPB3ZERO")
    1938                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PPB3ZERO")
    1939                      .dwattr $C$DW$152, DW_AT_bit_offset(0x05)
    1940                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1941                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1943              
    1944              $C$DW$153       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1946                      .dwattr $C$DW$153, DW_AT_name("rsvd3")
    1947                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd3")
    1948                      .dwattr $C$DW$153, DW_AT_bit_offset(0x04)
    1949                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1950                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1952              
    1953              $C$DW$154       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$154, DW_AT_name("PPB4TRIPHI")
    1956                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1957                      .dwattr $C$DW$154, DW_AT_bit_offset(0x03)
    1958                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1959                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1961              
    1962              $C$DW$155       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$155, DW_AT_name("PPB4TRIPLO")
    1965                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1966                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02)
    1967                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1968                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1970              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   39

    1971              $C$DW$156       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$156, DW_AT_name("PPB4ZERO")
    1974                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PPB4ZERO")
    1975                      .dwattr $C$DW$156, DW_AT_bit_offset(0x01)
    1976                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1977                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1979              
    1980              $C$DW$157       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1982                      .dwattr $C$DW$157, DW_AT_name("rsvd4")
    1983                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd4")
    1984                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1985                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1986                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1988              
    1989                      .dwendtag $C$DW$T$28
    1990              
    1991              
    1992              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1993                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
    1994                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1995              $C$DW$158       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1997                      .dwattr $C$DW$158, DW_AT_name("all")
    1998                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    1999                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2001              
    2002              $C$DW$159       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$28)
    2004                      .dwattr $C$DW$159, DW_AT_name("bit")
    2005                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    2006                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2008              
    2009                      .dwendtag $C$DW$T$29
    2010              
    2011              
    2012              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2013                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    2014                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2015              $C$DW$160       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2017                      .dwattr $C$DW$160, DW_AT_name("PPB1TRIPHI")
    2018                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2019                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    2020                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2021                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2023              
    2024              $C$DW$161       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   40

    2026                      .dwattr $C$DW$161, DW_AT_name("PPB1TRIPLO")
    2027                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2028                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    2029                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2030                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$162       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$162, DW_AT_name("PPB1ZERO")
    2036                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB1ZERO")
    2037                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0d)
    2038                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2039                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2040                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2041              
    2042              $C$DW$163       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2045                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd1")
    2046                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c)
    2047                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2048                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2049                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2050              
    2051              $C$DW$164       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2053                      .dwattr $C$DW$164, DW_AT_name("PPB2TRIPHI")
    2054                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2055                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0b)
    2056                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2057                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2059              
    2060              $C$DW$165       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$165, DW_AT_name("PPB2TRIPLO")
    2063                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2064                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0a)
    2065                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2066                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$166       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$166, DW_AT_name("PPB2ZERO")
    2072                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB2ZERO")
    2073                      .dwattr $C$DW$166, DW_AT_bit_offset(0x09)
    2074                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078              $C$DW$167       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2080                      .dwattr $C$DW$167, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   41

    2081                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd2")
    2082                      .dwattr $C$DW$167, DW_AT_bit_offset(0x08)
    2083                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2084                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2086              
    2087              $C$DW$168       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$168, DW_AT_name("PPB3TRIPHI")
    2090                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2091                      .dwattr $C$DW$168, DW_AT_bit_offset(0x07)
    2092                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2093                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2095              
    2096              $C$DW$169       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2098                      .dwattr $C$DW$169, DW_AT_name("PPB3TRIPLO")
    2099                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2100                      .dwattr $C$DW$169, DW_AT_bit_offset(0x06)
    2101                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2102                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2104              
    2105              $C$DW$170       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2107                      .dwattr $C$DW$170, DW_AT_name("PPB3ZERO")
    2108                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB3ZERO")
    2109                      .dwattr $C$DW$170, DW_AT_bit_offset(0x05)
    2110                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2111                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2113              
    2114              $C$DW$171       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$171, DW_AT_name("rsvd3")
    2117                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd3")
    2118                      .dwattr $C$DW$171, DW_AT_bit_offset(0x04)
    2119                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2120                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2122              
    2123              $C$DW$172       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2125                      .dwattr $C$DW$172, DW_AT_name("PPB4TRIPHI")
    2126                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2127                      .dwattr $C$DW$172, DW_AT_bit_offset(0x03)
    2128                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2129                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2131              
    2132              $C$DW$173       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2134                      .dwattr $C$DW$173, DW_AT_name("PPB4TRIPLO")
    2135                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PPB4TRIPLO")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   42

    2136                      .dwattr $C$DW$173, DW_AT_bit_offset(0x02)
    2137                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2138                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2140              
    2141              $C$DW$174       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2143                      .dwattr $C$DW$174, DW_AT_name("PPB4ZERO")
    2144                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PPB4ZERO")
    2145                      .dwattr $C$DW$174, DW_AT_bit_offset(0x01)
    2146                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2147                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2148                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2149              
    2150              $C$DW$175       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$175, DW_AT_name("rsvd4")
    2153                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd4")
    2154                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2155                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2156                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2158              
    2159                      .dwendtag $C$DW$T$30
    2160              
    2161              
    2162              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2163                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    2164                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2165              $C$DW$176       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2167                      .dwattr $C$DW$176, DW_AT_name("all")
    2168                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    2169                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2171              
    2172              $C$DW$177       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$30)
    2174                      .dwattr $C$DW$177, DW_AT_name("bit")
    2175                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    2176                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179                      .dwendtag $C$DW$T$31
    2180              
    2181              
    2182              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2183                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    2184                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2185              $C$DW$178       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$178, DW_AT_name("PPB1TRIPHI")
    2188                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2189                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0f)
    2190                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   43

    2191                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$179       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$179, DW_AT_name("PPB1TRIPLO")
    2197                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2198                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2199                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2200                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2202              
    2203              $C$DW$180       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2205                      .dwattr $C$DW$180, DW_AT_name("PPB1ZERO")
    2206                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PPB1ZERO")
    2207                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0d)
    2208                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2209                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2211              
    2212              $C$DW$181       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    2215                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    2216                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0c)
    2217                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    2218                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2219                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2220              
    2221              $C$DW$182       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$182, DW_AT_name("PPB2TRIPHI")
    2224                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2225                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0b)
    2226                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2229              
    2230              $C$DW$183       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$183, DW_AT_name("PPB2TRIPLO")
    2233                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2234                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0a)
    2235                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    2236                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2238              
    2239              $C$DW$184       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2241                      .dwattr $C$DW$184, DW_AT_name("PPB2ZERO")
    2242                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PPB2ZERO")
    2243                      .dwattr $C$DW$184, DW_AT_bit_offset(0x09)
    2244                      .dwattr $C$DW$184, DW_AT_bit_size(0x01)
    2245                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   44

    2246                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2247              
    2248              $C$DW$185       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2250                      .dwattr $C$DW$185, DW_AT_name("rsvd2")
    2251                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd2")
    2252                      .dwattr $C$DW$185, DW_AT_bit_offset(0x08)
    2253                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2254                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257              $C$DW$186       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$186, DW_AT_name("PPB3TRIPHI")
    2260                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2261                      .dwattr $C$DW$186, DW_AT_bit_offset(0x07)
    2262                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2263                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2265              
    2266              $C$DW$187       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2268                      .dwattr $C$DW$187, DW_AT_name("PPB3TRIPLO")
    2269                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2270                      .dwattr $C$DW$187, DW_AT_bit_offset(0x06)
    2271                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2272                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2273                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2274              
    2275              $C$DW$188       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2277                      .dwattr $C$DW$188, DW_AT_name("PPB3ZERO")
    2278                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PPB3ZERO")
    2279                      .dwattr $C$DW$188, DW_AT_bit_offset(0x05)
    2280                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2281                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2282                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2283              
    2284              $C$DW$189       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2286                      .dwattr $C$DW$189, DW_AT_name("rsvd3")
    2287                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd3")
    2288                      .dwattr $C$DW$189, DW_AT_bit_offset(0x04)
    2289                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2290                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2291                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2292              
    2293              $C$DW$190       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2295                      .dwattr $C$DW$190, DW_AT_name("PPB4TRIPHI")
    2296                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2297                      .dwattr $C$DW$190, DW_AT_bit_offset(0x03)
    2298                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2299                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2300                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   45

    2301              
    2302              $C$DW$191       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2304                      .dwattr $C$DW$191, DW_AT_name("PPB4TRIPLO")
    2305                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2306                      .dwattr $C$DW$191, DW_AT_bit_offset(0x02)
    2307                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2308                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2310              
    2311              $C$DW$192       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2313                      .dwattr $C$DW$192, DW_AT_name("PPB4ZERO")
    2314                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PPB4ZERO")
    2315                      .dwattr $C$DW$192, DW_AT_bit_offset(0x01)
    2316                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2317                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2318                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2319              
    2320              $C$DW$193       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2322                      .dwattr $C$DW$193, DW_AT_name("rsvd4")
    2323                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd4")
    2324                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    2325                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2326                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2328              
    2329                      .dwendtag $C$DW$T$32
    2330              
    2331              
    2332              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2333                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    2334                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2335              $C$DW$194       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2337                      .dwattr $C$DW$194, DW_AT_name("all")
    2338                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    2339                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342              $C$DW$195       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$32)
    2344                      .dwattr $C$DW$195, DW_AT_name("bit")
    2345                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    2346                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2348              
    2349                      .dwendtag $C$DW$T$33
    2350              
    2351              
    2352              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2353                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    2354                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2355              $C$DW$196       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   46

    2356                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2357                      .dwattr $C$DW$196, DW_AT_name("PPB1TRIPHI")
    2358                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2359                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0f)
    2360                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2361                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2363              
    2364              $C$DW$197       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2366                      .dwattr $C$DW$197, DW_AT_name("PPB1TRIPLO")
    2367                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2368                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0e)
    2369                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2370                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$198       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2375                      .dwattr $C$DW$198, DW_AT_name("PPB1ZERO")
    2376                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PPB1ZERO")
    2377                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0d)
    2378                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2379                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2381              
    2382              $C$DW$199       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2384                      .dwattr $C$DW$199, DW_AT_name("rsvd1")
    2385                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd1")
    2386                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0c)
    2387                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2388                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2389                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2390              
    2391              $C$DW$200       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2393                      .dwattr $C$DW$200, DW_AT_name("PPB2TRIPHI")
    2394                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2395                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0b)
    2396                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2397                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2398                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2399              
    2400              $C$DW$201       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2402                      .dwattr $C$DW$201, DW_AT_name("PPB2TRIPLO")
    2403                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2404                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0a)
    2405                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2406                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2408              
    2409              $C$DW$202       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   47

    2411                      .dwattr $C$DW$202, DW_AT_name("PPB2ZERO")
    2412                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PPB2ZERO")
    2413                      .dwattr $C$DW$202, DW_AT_bit_offset(0x09)
    2414                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2415                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2416                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2417              
    2418              $C$DW$203       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2420                      .dwattr $C$DW$203, DW_AT_name("rsvd2")
    2421                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd2")
    2422                      .dwattr $C$DW$203, DW_AT_bit_offset(0x08)
    2423                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2424                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2425                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2426              
    2427              $C$DW$204       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2429                      .dwattr $C$DW$204, DW_AT_name("PPB3TRIPHI")
    2430                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2431                      .dwattr $C$DW$204, DW_AT_bit_offset(0x07)
    2432                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2433                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$205       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2438                      .dwattr $C$DW$205, DW_AT_name("PPB3TRIPLO")
    2439                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2440                      .dwattr $C$DW$205, DW_AT_bit_offset(0x06)
    2441                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2442                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2443                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2444              
    2445              $C$DW$206       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2447                      .dwattr $C$DW$206, DW_AT_name("PPB3ZERO")
    2448                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_PPB3ZERO")
    2449                      .dwattr $C$DW$206, DW_AT_bit_offset(0x05)
    2450                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2451                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2453              
    2454              $C$DW$207       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$207, DW_AT_name("rsvd3")
    2457                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd3")
    2458                      .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    2459                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2460                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463              $C$DW$208       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2465                      .dwattr $C$DW$208, DW_AT_name("PPB4TRIPHI")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   48

    2466                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2467                      .dwattr $C$DW$208, DW_AT_bit_offset(0x03)
    2468                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2469                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2471              
    2472              $C$DW$209       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2474                      .dwattr $C$DW$209, DW_AT_name("PPB4TRIPLO")
    2475                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2476                      .dwattr $C$DW$209, DW_AT_bit_offset(0x02)
    2477                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2478                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$210       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2483                      .dwattr $C$DW$210, DW_AT_name("PPB4ZERO")
    2484                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PPB4ZERO")
    2485                      .dwattr $C$DW$210, DW_AT_bit_offset(0x01)
    2486                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2487                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490              $C$DW$211       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2492                      .dwattr $C$DW$211, DW_AT_name("rsvd4")
    2493                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd4")
    2494                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00)
    2495                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2496                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499                      .dwendtag $C$DW$T$34
    2500              
    2501              
    2502              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2503                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    2504                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2505              $C$DW$212       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2507                      .dwattr $C$DW$212, DW_AT_name("all")
    2508                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_all")
    2509                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512              $C$DW$213       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$34)
    2514                      .dwattr $C$DW$213, DW_AT_name("bit")
    2515                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_bit")
    2516                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2518              
    2519                      .dwendtag $C$DW$T$35
    2520              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   49

    2521              
    2522              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2523                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    2524                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2525              $C$DW$214       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2527                      .dwattr $C$DW$214, DW_AT_name("ADCINT1")
    2528                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_ADCINT1")
    2529                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0f)
    2530                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2531                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2533              
    2534              $C$DW$215       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$215, DW_AT_name("ADCINT2")
    2537                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ADCINT2")
    2538                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0e)
    2539                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2540                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2542              
    2543              $C$DW$216       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2545                      .dwattr $C$DW$216, DW_AT_name("ADCINT3")
    2546                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_ADCINT3")
    2547                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0d)
    2548                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2549                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2551              
    2552              $C$DW$217       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2554                      .dwattr $C$DW$217, DW_AT_name("ADCINT4")
    2555                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ADCINT4")
    2556                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0c)
    2557                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2558                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2559                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2560              
    2561              $C$DW$218       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2563                      .dwattr $C$DW$218, DW_AT_name("rsvd1")
    2564                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd1")
    2565                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    2566                      .dwattr $C$DW$218, DW_AT_bit_size(0x0c)
    2567                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2568                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2569              
    2570                      .dwendtag $C$DW$T$36
    2571              
    2572              
    2573              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2574                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    2575                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   50

    2576              $C$DW$219       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2578                      .dwattr $C$DW$219, DW_AT_name("all")
    2579                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    2580                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2582              
    2583              $C$DW$220       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$36)
    2585                      .dwattr $C$DW$220, DW_AT_name("bit")
    2586                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    2587                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2588                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2589              
    2590                      .dwendtag $C$DW$T$37
    2591              
    2592              
    2593              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2594                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    2595                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2596              $C$DW$221       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2598                      .dwattr $C$DW$221, DW_AT_name("ADCINT1")
    2599                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_ADCINT1")
    2600                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0f)
    2601                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2602                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2604              
    2605              $C$DW$222       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2607                      .dwattr $C$DW$222, DW_AT_name("ADCINT2")
    2608                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ADCINT2")
    2609                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2610                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2611                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2613              
    2614              $C$DW$223       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2616                      .dwattr $C$DW$223, DW_AT_name("ADCINT3")
    2617                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_ADCINT3")
    2618                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2619                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2620                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2621                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2622              
    2623              $C$DW$224       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2625                      .dwattr $C$DW$224, DW_AT_name("ADCINT4")
    2626                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_ADCINT4")
    2627                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0c)
    2628                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2629                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2630                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   51

    2631              
    2632              $C$DW$225       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2634                      .dwattr $C$DW$225, DW_AT_name("rsvd1")
    2635                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd1")
    2636                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00)
    2637                      .dwattr $C$DW$225, DW_AT_bit_size(0x0c)
    2638                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2640              
    2641                      .dwendtag $C$DW$T$38
    2642              
    2643              
    2644              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2645                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    2646                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2647              $C$DW$226       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$226, DW_AT_name("all")
    2650                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_all")
    2651                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654              $C$DW$227       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$38)
    2656                      .dwattr $C$DW$227, DW_AT_name("bit")
    2657                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_bit")
    2658                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2660              
    2661                      .dwendtag $C$DW$T$39
    2662              
    2663              
    2664              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2665                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    2666                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2667              $C$DW$228       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$228, DW_AT_name("ADCINT1")
    2670                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ADCINT1")
    2671                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0f)
    2672                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2673                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2675              
    2676              $C$DW$229       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2678                      .dwattr $C$DW$229, DW_AT_name("ADCINT2")
    2679                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_ADCINT2")
    2680                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0e)
    2681                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2682                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2684              
    2685              $C$DW$230       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   52

    2686                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2687                      .dwattr $C$DW$230, DW_AT_name("ADCINT3")
    2688                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_ADCINT3")
    2689                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0d)
    2690                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2691                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2692                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2693              
    2694              $C$DW$231       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2696                      .dwattr $C$DW$231, DW_AT_name("ADCINT4")
    2697                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_ADCINT4")
    2698                      .dwattr $C$DW$231, DW_AT_bit_offset(0x0c)
    2699                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2700                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2702              
    2703              $C$DW$232       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2705                      .dwattr $C$DW$232, DW_AT_name("rsvd1")
    2706                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd1")
    2707                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00)
    2708                      .dwattr $C$DW$232, DW_AT_bit_size(0x0c)
    2709                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2710                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2711              
    2712                      .dwendtag $C$DW$T$40
    2713              
    2714              
    2715              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2716                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    2717                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2718              $C$DW$233       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2720                      .dwattr $C$DW$233, DW_AT_name("all")
    2721                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    2722                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$234       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$40)
    2727                      .dwattr $C$DW$234, DW_AT_name("bit")
    2728                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
    2729                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732                      .dwendtag $C$DW$T$41
    2733              
    2734              
    2735              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2736                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    2737                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2738              $C$DW$235       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2740                      .dwattr $C$DW$235, DW_AT_name("ADCINT1")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   53

    2741                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_ADCINT1")
    2742                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0f)
    2743                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2744                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2746              
    2747              $C$DW$236       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2749                      .dwattr $C$DW$236, DW_AT_name("ADCINT2")
    2750                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_ADCINT2")
    2751                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0e)
    2752                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2753                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2755              
    2756              $C$DW$237       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2758                      .dwattr $C$DW$237, DW_AT_name("ADCINT3")
    2759                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ADCINT3")
    2760                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0d)
    2761                      .dwattr $C$DW$237, DW_AT_bit_size(0x01)
    2762                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2763                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2764              
    2765              $C$DW$238       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2767                      .dwattr $C$DW$238, DW_AT_name("ADCINT4")
    2768                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_ADCINT4")
    2769                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0c)
    2770                      .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    2771                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2773              
    2774              $C$DW$239       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2776                      .dwattr $C$DW$239, DW_AT_name("rsvd1")
    2777                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd1")
    2778                      .dwattr $C$DW$239, DW_AT_bit_offset(0x00)
    2779                      .dwattr $C$DW$239, DW_AT_bit_size(0x0c)
    2780                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2782              
    2783                      .dwendtag $C$DW$T$42
    2784              
    2785              
    2786              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2787                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    2788                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2789              $C$DW$240       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2791                      .dwattr $C$DW$240, DW_AT_name("all")
    2792                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_all")
    2793                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2795              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
config.asm                                                           PAGE   54

    2796              $C$DW$241       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$42)
    2798                      .dwattr $C$DW$241, DW_AT_name("bit")
    2799                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_bit")
    2800                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2801                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2802              
    2803                      .dwendtag $C$DW$T$43
    2804              
    2805              
    2806              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2807                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    2808                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2809              $C$DW$242       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2811                      .dwattr $C$DW$242, DW_AT_name("INT1SEL")
    2812                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INT1SEL")
    2813                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
    2814                      .dwattr $C$DW$242, DW_AT_bit_size(0x04)
    2815                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2817              
    2818              $C$DW$243       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2820                      .dwattr $C$DW$243, DW_AT_name("rsvd1")
    2821                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd1")
    2822                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0b)
    2823                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2824                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$244       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2829                      .dwattr $C$DW$244, DW_AT_name("INT1E")
    2830                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INT1E")
    2831                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0a)
    2832                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2833                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2834                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2835              
    2836              $C$DW$245       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2838                      .dwattr $C$DW$245, DW_AT_name("INT1CONT")
    2839                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INT1CONT")
