TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.5.LTS *
       3              ;* Date/Time created: Wed Jan 11 17:05:06 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\jason\workspace_v10_4\MonoMtrServo_379D\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8301_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8301_SPI_Write")

drv8301.asm                                                          PAGE    8

     363                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$306)
     364                      .dwattr $C$DW$24, DW_AT_location[DW_OP_reg12]
     365              
     366              
     367              ;***************************************************************
     368              ;* FNAME: _DRV8301_diagnostics          FR SIZE:   2           *
     369              ;*                                                             *
     370              ;* FUNCTION ENVIRONMENT                                        *
     371              ;*                                                             *
     372              ;* FUNCTION PROPERTIES                                         *
     373              ;*                            0 Parameter,  0 Auto,  2 SOE     *
     374              ;***************************************************************
     375              
     376              _DRV8301_diagnostics:
     377              ;* AR1   assigned to _motor
     378              $C$DW$25        .dwtag  DW_TAG_variable
     379                      .dwattr $C$DW$25, DW_AT_name("motor")
     380                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_motor")
     381                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$307)
     382                      .dwattr $C$DW$25, DW_AT_location[DW_OP_reg6]
     383              
     384                      .dwcfi  cfa_offset, -2
     385                      .dwcfi  save_reg_to_mem, 26, 0
     386 0000006d B2BD          MOVL      *SP++,XAR1            ; [CPU_ALU] 
     387                      .dwcfi  save_reg_to_mem, 7, 2
     388                      .dwcfi  cfa_offset, -4
     389                      .dwpsn  file "../drv8301.c",line 134,column 2,is_stmt,isa 0
     390 0000006e 9A00          MOVB      AL,#0                 ; [CPU_ALU] |134| 
     391                      .dwpsn  file "../drv8301.c",line 132,column 1,is_stmt,isa 0
     392 0000006f 8BA4          MOVL      XAR1,XAR4             ; [CPU_ALU] |132| 
     393                      .dwpsn  file "../drv8301.c",line 134,column 2,is_stmt,isa 0
     394              $C$DW$26        .dwtag  DW_TAG_TI_branch
     395                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     396                      .dwattr $C$DW$26, DW_AT_name("_DRV8301_SPI_Read")
     397                      .dwattr $C$DW$26, DW_AT_TI_call
     398              
     399 00000070 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_ALU] |134| 
         00000071 0000 
     400                      ; call occurs [#_DRV8301_SPI_Read] ; [] |134| 
     401 00000072 8D00          MOVL      XAR0,#472             ; [CPU_ALU] |134| 
         00000073 01D8 
     402 00000074 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |134| 
     403                      .dwpsn  file "../drv8301.c",line 137,column 2,is_stmt,isa 0
     404 00000075 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |137| 
     405 00000076 9A01          MOVB      AL,#1                 ; [CPU_ALU] |137| 
     406              $C$DW$27        .dwtag  DW_TAG_TI_branch
     407                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     408                      .dwattr $C$DW$27, DW_AT_name("_DRV8301_SPI_Read")
     409                      .dwattr $C$DW$27, DW_AT_TI_call
     410              
     411 00000077 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_ALU] |137| 
         00000078 0000 
     412                      ; call occurs [#_DRV8301_SPI_Read] ; [] |137| 
     413 00000079 8D00          MOVL      XAR0,#473             ; [CPU_ALU] |137| 
         0000007a 01D9 
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    9

     414 0000007b 9080          ANDB      AL,#128               ; [CPU_ALU] |137| 
     415 0000007c 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |137| 
     416 0000007d 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     417                      .dwcfi  cfa_offset, -2
     418                      .dwcfi  restore_reg, 7
     419              $C$DW$28        .dwtag  DW_TAG_TI_branch
     420                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     421                      .dwattr $C$DW$28, DW_AT_TI_return
     422              
     423 0000007e 0006          LRETR     ; [CPU_ALU] 
     424                      ; return occurs ; [] 
     425                      .dwattr $C$DW$23, DW_AT_TI_end_file("../drv8301.c")
     426                      .dwattr $C$DW$23, DW_AT_TI_end_line(0x96)
     427                      .dwattr $C$DW$23, DW_AT_TI_end_column(0x01)
     428                      .dwendentry
     429                      .dwendtag $C$DW$23
     430              
     431              ;**************************************************************
     432              ;* UNDEFINED EXTERNAL REFERENCES                              *
     433              ;**************************************************************
     434                      .global _DRV8301_SPI_Write
     435                      .global _DRV8301_SPI_Read
     436              
     437              ;***************************************************************
     438              ;* TYPE INFORMATION                                            *
     439              ;***************************************************************
     440              
     441              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     442                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     443              $C$DW$29        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     445                      .dwattr $C$DW$29, DW_AT_name("As")
     446                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_As")
     447                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     448                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     449              
     450              $C$DW$30        .dwtag  DW_TAG_member
     451                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     452                      .dwattr $C$DW$30, DW_AT_name("Bs")
     453                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_Bs")
     454                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     455                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     456              
     457              $C$DW$31        .dwtag  DW_TAG_member
     458                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     459                      .dwattr $C$DW$31, DW_AT_name("Cs")
     460                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Cs")
     461                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     462                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     463              
     464              $C$DW$32        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     466                      .dwattr $C$DW$32, DW_AT_name("Alpha")
     467                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Alpha")
     468                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   10

     469                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471              $C$DW$33        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$33, DW_AT_name("Beta")
     474                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Beta")
     475                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     476                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     477              
     478                      .dwendtag $C$DW$T$20
     479              
     480              $C$DW$T$80      .dwtag  DW_TAG_typedef
     481                      .dwattr $C$DW$T$80, DW_AT_name("CLARKE")
     482                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$20)
     483                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     484              
     485              
     486              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     487                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     488              $C$DW$34        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     490                      .dwattr $C$DW$34, DW_AT_name("Alpha")
     491                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Alpha")
     492                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     494              
     495              $C$DW$35        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$35, DW_AT_name("Beta")
     498                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Beta")
     499                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     500                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$36        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$36, DW_AT_name("Angle")
     505                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_Angle")
     506                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     507                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     508              
     509              $C$DW$37        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$37, DW_AT_name("Ds")
     512                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Ds")
     513                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     514                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$38        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$38, DW_AT_name("Qs")
     519                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_Qs")
     520                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     521                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     522              
     523              $C$DW$39        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   11

     524                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$39, DW_AT_name("Sine")
     526                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_Sine")
     527                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     528                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$40        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$40, DW_AT_name("Cosine")
     533                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_Cosine")
     534                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     535                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     536              
     537                      .dwendtag $C$DW$T$21
     538              
     539              $C$DW$T$81      .dwtag  DW_TAG_typedef
     540                      .dwattr $C$DW$T$81, DW_AT_name("PARK")
     541                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$21)
     542                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     543              
     544              
     545              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     546                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     547              $C$DW$41        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$41, DW_AT_name("Alpha")
     550                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_Alpha")
     551                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554              $C$DW$42        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$42, DW_AT_name("Beta")
     557                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_Beta")
     558                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     559                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     560              
     561              $C$DW$43        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     563                      .dwattr $C$DW$43, DW_AT_name("Angle")
     564                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_Angle")
     565                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     566                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     567              
     568              $C$DW$44        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$44, DW_AT_name("Ds")
     571                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_Ds")
     572                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     573                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     574              
     575              $C$DW$45        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$45, DW_AT_name("Qs")
     578                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Qs")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   12

     579                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     580                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     581              
     582              $C$DW$46        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$46, DW_AT_name("Sine")
     585                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Sine")
     586                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     587                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     588              
     589              $C$DW$47        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$47, DW_AT_name("Cosine")
     592                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Cosine")
     593                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     594                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596                      .dwendtag $C$DW$T$22
     597              
     598              $C$DW$T$82      .dwtag  DW_TAG_typedef
     599                      .dwattr $C$DW$T$82, DW_AT_name("IPARK")
     600                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$22)
     601                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
     602              
     603              
     604              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     605                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     606              $C$DW$48        .dwtag  DW_TAG_member
     607                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     608                      .dwattr $C$DW$48, DW_AT_name("Ref")
     609                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Ref")
     610                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     612              
     613              $C$DW$49        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$49, DW_AT_name("Fbk")
     616                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Fbk")
     617                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     618                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     619              
     620              $C$DW$50        .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     622                      .dwattr $C$DW$50, DW_AT_name("Out")
     623                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Out")
     624                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     625                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     626              
     627              $C$DW$51        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     629                      .dwattr $C$DW$51, DW_AT_name("Kp")
     630                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Kp")
     631                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     632                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     633              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   13

     634              $C$DW$52        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$52, DW_AT_name("Ki")
     637                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ki")
     638                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     639                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641              $C$DW$53        .dwtag  DW_TAG_member
     642                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$53, DW_AT_name("Umax")
     644                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Umax")
     645                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     646                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     647              
     648              $C$DW$54        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     650                      .dwattr $C$DW$54, DW_AT_name("Umin")
     651                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Umin")
     652                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     653                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     654              
     655              $C$DW$55        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$55, DW_AT_name("up")
     658                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_up")
     659                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     660                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662              $C$DW$56        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$56, DW_AT_name("ui")
     665                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ui")
     666                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     667                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669              $C$DW$57        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     671                      .dwattr $C$DW$57, DW_AT_name("v1")
     672                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_v1")
     673                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     674                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$58        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$58, DW_AT_name("i1")
     679                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_i1")
     680                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     681                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     682              
     683              $C$DW$59        .dwtag  DW_TAG_member
     684                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     685                      .dwattr $C$DW$59, DW_AT_name("w1")
     686                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_w1")
     687                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     688                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   14

     689              
     690                      .dwendtag $C$DW$T$23
     691              
     692              $C$DW$T$83      .dwtag  DW_TAG_typedef
     693                      .dwattr $C$DW$T$83, DW_AT_name("PI_CONTROLLER")
     694                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$23)
     695                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
     696              
     697              
     698              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     699                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     700              $C$DW$60        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$60, DW_AT_name("Ref")
     703                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Ref")
     704                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$61        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$61, DW_AT_name("Fbk")
     710                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Fbk")
     711                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     712                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714              $C$DW$62        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$62, DW_AT_name("Out")
     717                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Out")
     718                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     719                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     720              
     721              $C$DW$63        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$63, DW_AT_name("c1")
     724                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_c1")
     725                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     726                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     727              
     728              $C$DW$64        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$64, DW_AT_name("c2")
     731                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_c2")
     732                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     733                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     734              
     735                      .dwendtag $C$DW$T$24
     736              
     737              $C$DW$T$27      .dwtag  DW_TAG_typedef
     738                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
     739                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     740                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     741              
     742              
     743              $C$DW$T$25      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   15

     744                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     745              $C$DW$65        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$65, DW_AT_name("Kr")
     748                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Kr")
     749                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$66        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$66, DW_AT_name("Kp")
     755                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Kp")
     756                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     757                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$67        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$67, DW_AT_name("Ki")
     762                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ki")
     763                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     764                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$68        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$68, DW_AT_name("Kd")
     769                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Kd")
     770                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     771                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773              $C$DW$69        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$69, DW_AT_name("Km")
     776                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Km")
     777                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     778                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     779              
     780              $C$DW$70        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$70, DW_AT_name("Umax")
     783                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Umax")
     784                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     785                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     786              
     787              $C$DW$71        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$71, DW_AT_name("Umin")
     790                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Umin")
     791                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     792                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     793              
     794                      .dwendtag $C$DW$T$25
     795              
     796              $C$DW$T$28      .dwtag  DW_TAG_typedef
     797                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
     798                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   16

     799                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     800              
     801              
     802              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     803                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     804              $C$DW$72        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$72, DW_AT_name("up")
     807                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_up")
     808                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$73        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$73, DW_AT_name("ui")
     814                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ui")
     815                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     816                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$74        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$74, DW_AT_name("ud")
     821                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ud")
     822                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     823                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$75        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$75, DW_AT_name("v1")
     828                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_v1")
     829                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     830                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832              $C$DW$76        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$76, DW_AT_name("i1")
     835                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_i1")
     836                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     837                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     838              
     839              $C$DW$77        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$77, DW_AT_name("d1")
     842                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_d1")
     843                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     844                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     845              
     846              $C$DW$78        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$78, DW_AT_name("d2")
     849                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_d2")
     850                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     851                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$79        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   17

     854                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$79, DW_AT_name("w1")
     856                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_w1")
     857                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     858                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     859              
     860                      .dwendtag $C$DW$T$26
     861              
     862              $C$DW$T$29      .dwtag  DW_TAG_typedef
     863                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
     864                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     865                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     866              
     867              
     868              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     869                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
     870              $C$DW$80        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$27)
     872                      .dwattr $C$DW$80, DW_AT_name("term")
     873                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_term")
     874                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     876              
     877              $C$DW$81        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
     879                      .dwattr $C$DW$81, DW_AT_name("param")
     880                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_param")
     881                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     882                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$82        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     886                      .dwattr $C$DW$82, DW_AT_name("data")
     887                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_data")
     888                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     889                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891                      .dwendtag $C$DW$T$30
     892              
     893              $C$DW$T$84      .dwtag  DW_TAG_typedef
     894                      .dwattr $C$DW$T$84, DW_AT_name("PID_CONTROLLER")
     895                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$30)
     896                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
     897              
     898              
     899              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     900                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
     901              $C$DW$83        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$83, DW_AT_name("Ref")
     904                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Ref")
     905                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     907              
     908              $C$DW$84        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   18

     909                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$84, DW_AT_name("Fbk")
     911                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Fbk")
     912                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     913                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     914              
     915              $C$DW$85        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$85, DW_AT_name("Out")
     918                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Out")
     919                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     920                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     921              
     922              $C$DW$86        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$86, DW_AT_name("c1")
     925                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_c1")
     926                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     927                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     928              
     929              $C$DW$87        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$87, DW_AT_name("c2")
     932                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_c2")
     933                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     934                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     935              
     936                      .dwendtag $C$DW$T$31
     937              
     938              $C$DW$T$34      .dwtag  DW_TAG_typedef
     939                      .dwattr $C$DW$T$34, DW_AT_name("PI_TERMINALS")
     940                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
     941                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     942              
     943              
     944              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     945                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
     946              $C$DW$88        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     948                      .dwattr $C$DW$88, DW_AT_name("Kr")
     949                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Kr")
     950                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     952              
     953              $C$DW$89        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     955                      .dwattr $C$DW$89, DW_AT_name("Kp")
     956                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Kp")
     957                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     958                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     959              
     960              $C$DW$90        .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     962                      .dwattr $C$DW$90, DW_AT_name("Ki")
     963                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Ki")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   19

     964                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     965                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     966              
     967              $C$DW$91        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$91, DW_AT_name("Kd")
     970                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Kd")
     971                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     972                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$92        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$92, DW_AT_name("Km")
     977                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Km")
     978                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     979                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981              $C$DW$93        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$93, DW_AT_name("Umax")
     984                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Umax")
     985                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     986                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$94        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$94, DW_AT_name("Umin")
     991                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Umin")
     992                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     993                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$95        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$95, DW_AT_name("T")
     998                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_T")
     999                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1000                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$96        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$96, DW_AT_name("divT")
    1005                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_divT")
    1006                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1007                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1008              
    1009              $C$DW$97        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$97, DW_AT_name("Kt")
    1012                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Kt")
    1013                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1014                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016                      .dwendtag $C$DW$T$32
    1017              
    1018              $C$DW$T$35      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   20

    1019                      .dwattr $C$DW$T$35, DW_AT_name("PI_PARAMETERS")
    1020                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    1021                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1022              
    1023              
    1024              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1025                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    1026              $C$DW$98        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$98, DW_AT_name("up")
    1029                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_up")
    1030                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033              $C$DW$99        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$99, DW_AT_name("ui")
    1036                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ui")
    1037                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1038                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1039              
    1040              $C$DW$100       .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$100, DW_AT_name("v1")
    1043                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_v1")
    1044                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1045                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$101       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$101, DW_AT_name("i1")
    1050                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_i1")
    1051                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1052                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$102       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$102, DW_AT_name("w1")
    1057                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_w1")
    1058                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1059                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061                      .dwendtag $C$DW$T$33
    1062              
    1063              $C$DW$T$36      .dwtag  DW_TAG_typedef
    1064                      .dwattr $C$DW$T$36, DW_AT_name("PI_DATA")
    1065                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    1066                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1067              
    1068              
    1069              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1070                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x28)
    1071              $C$DW$103       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$34)
    1073                      .dwattr $C$DW$103, DW_AT_name("term")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   21

    1074                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_term")
    1075                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078              $C$DW$104       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$35)
    1080                      .dwattr $C$DW$104, DW_AT_name("param")
    1081                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_param")
    1082                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1083                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1084              
    1085              $C$DW$105       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
    1087                      .dwattr $C$DW$105, DW_AT_name("data")
    1088                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_data")
    1089                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1090                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1091              
    1092                      .dwendtag $C$DW$T$37
    1093              
    1094              $C$DW$T$85      .dwtag  DW_TAG_typedef
    1095                      .dwattr $C$DW$T$85, DW_AT_name("PI_SPEED_CONTROLLER")
    1096                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$37)
    1097                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1098              
    1099              
    1100              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1101                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    1102              $C$DW$106       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$16)
    1104                      .dwattr $C$DW$106, DW_AT_name("MechTheta")
    1105                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_MechTheta")
    1106                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$107       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$16)
    1111                      .dwattr $C$DW$107, DW_AT_name("OldMechTheta")
    1112                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_OldMechTheta")
    1113                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1114                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116              $C$DW$108       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$16)
    1118                      .dwattr $C$DW$108, DW_AT_name("PosError")
    1119                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PosError")
    1120                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1121                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$109       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$16)
    1125                      .dwattr $C$DW$109, DW_AT_name("PosErrorKdDivJest")
    1126                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PosErrorKdDivJest")
    1127                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1128                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   22

    1129              
    1130              $C$DW$110       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$16)
    1132                      .dwattr $C$DW$110, DW_AT_name("PosErrorKp")
    1133                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PosErrorKp")
    1134                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1135                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$111       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$16)
    1139                      .dwattr $C$DW$111, DW_AT_name("PosErrorKi")
    1140                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PosErrorKi")
    1141                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1142                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$112       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$16)
    1146                      .dwattr $C$DW$112, DW_AT_name("TorqueCmd")
    1147                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_TorqueCmd")
    1148                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1149                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$113       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$16)
    1153                      .dwattr $C$DW$113, DW_AT_name("D_est")
    1154                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_D_est")
    1155                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1156                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$114       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$16)
    1160                      .dwattr $C$DW$114, DW_AT_name("CurrentCmd")
    1161                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CurrentCmd")
    1162                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1163                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$115       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$16)
    1167                      .dwattr $C$DW$115, DW_AT_name("AccEst")
    1168                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_AccEst")
    1169                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1170                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$116       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$16)
    1174                      .dwattr $C$DW$116, DW_AT_name("Enhanced_SpeedEst")
    1175                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_Enhanced_SpeedEst")
    1176                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1177                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$117       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$16)
    1181                      .dwattr $C$DW$117, DW_AT_name("Enhanced_SpeedEst_pu")
    1182                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Enhanced_SpeedEst_pu")
    1183                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   23

    1184                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$118       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$16)
    1188                      .dwattr $C$DW$118, DW_AT_name("SpeedEst")
    1189                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SpeedEst")
    1190                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1191                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$119       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$16)
    1195                      .dwattr $C$DW$119, DW_AT_name("PosEst")
    1196                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PosEst")
    1197                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1198                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$120       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$38)
    1202                      .dwattr $C$DW$120, DW_AT_name("SpeedRpm")
    1203                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SpeedRpm")
    1204                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1205                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207                      .dwendtag $C$DW$T$39
    1208              
    1209              $C$DW$T$42      .dwtag  DW_TAG_typedef
    1210                      .dwattr $C$DW$T$42, DW_AT_name("V_EST_TERMINALS")
    1211                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    1212                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1213              
    1214              
    1215              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1216                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1217              $C$DW$121       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$16)
    1219                      .dwattr $C$DW$121, DW_AT_name("Kd")
    1220                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_Kd")
    1221                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$122       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$16)
    1226                      .dwattr $C$DW$122, DW_AT_name("Kp")
    1227                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_Kp")
    1228                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1229                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1230              
    1231              $C$DW$123       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$16)
    1233                      .dwattr $C$DW$123, DW_AT_name("Ki")
    1234                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Ki")
    1235                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1236                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$124       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   24

    1239                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$16)
    1240                      .dwattr $C$DW$124, DW_AT_name("Kt")
    1241                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Kt")
    1242                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1243                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1244              
    1245              $C$DW$125       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$16)
    1247                      .dwattr $C$DW$125, DW_AT_name("T_est")
    1248                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_T_est")
    1249                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1250                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252              $C$DW$126       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$16)
    1254                      .dwattr $C$DW$126, DW_AT_name("f_est")
    1255                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_f_est")
    1256                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1257                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1258              
    1259              $C$DW$127       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$16)
    1261                      .dwattr $C$DW$127, DW_AT_name("J_est")
    1262                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_J_est")
    1263                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1264                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1265              
    1266              $C$DW$128       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$16)
    1268                      .dwattr $C$DW$128, DW_AT_name("divJ_est")
    1269                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_divJ_est")
    1270                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1271                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273              $C$DW$129       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$40)
    1275                      .dwattr $C$DW$129, DW_AT_name("BaseRpm")
    1276                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_BaseRpm")
    1277                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1278                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280                      .dwendtag $C$DW$T$41
    1281              
    1282              $C$DW$T$43      .dwtag  DW_TAG_typedef
    1283                      .dwattr $C$DW$T$43, DW_AT_name("V_EST_PARAMETERS")
    1284                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$41)
    1285                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1286              
    1287              
    1288              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1289                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x30)
    1290              $C$DW$130       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$42)
    1292                      .dwattr $C$DW$130, DW_AT_name("term")
    1293                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_term")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   25

    1294                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$131       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$43)
    1299                      .dwattr $C$DW$131, DW_AT_name("param")
    1300                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_param")
    1301                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1302                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304                      .dwendtag $C$DW$T$44
    1305              
    1306              $C$DW$T$86      .dwtag  DW_TAG_typedef
    1307                      .dwattr $C$DW$T$86, DW_AT_name("V_ESTIMATOR")
    1308                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$44)
    1309                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1310              
    1311              
    1312              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1313                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    1314              $C$DW$132       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$132, DW_AT_name("Ualpha")
    1317                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_Ualpha")
    1318                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1320              
    1321              $C$DW$133       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$133, DW_AT_name("Ubeta")
    1324                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_Ubeta")
    1325                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1326                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328              $C$DW$134       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$134, DW_AT_name("Ta")
    1331                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_Ta")
    1332                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1333                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335              $C$DW$135       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$135, DW_AT_name("Tb")
    1338                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_Tb")
    1339                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1340                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$136       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$136, DW_AT_name("Tc")
    1345                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Tc")
    1346                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1347                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1348              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   26

    1349              $C$DW$137       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$137, DW_AT_name("tmp1")
    1352                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_tmp1")
    1353                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1354                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1355              
    1356              $C$DW$138       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$138, DW_AT_name("tmp2")
    1359                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_tmp2")
    1360                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1361                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363              $C$DW$139       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$139, DW_AT_name("tmp3")
    1366                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_tmp3")
    1367                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1368                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1369              
    1370              $C$DW$140       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$45)
    1372                      .dwattr $C$DW$140, DW_AT_name("VecSector")
    1373                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_VecSector")
    1374                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1375                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377                      .dwendtag $C$DW$T$46
    1378              
    1379              $C$DW$T$87      .dwtag  DW_TAG_typedef
    1380                      .dwattr $C$DW$T$87, DW_AT_name("SVGEN")
    1381                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$46)
    1382                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1383              
    1384              
    1385              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1386                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    1387              $C$DW$141       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1389                      .dwattr $C$DW$141, DW_AT_name("TargetValue")
    1390                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_TargetValue")
    1391                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$142       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$40)
    1396                      .dwattr $C$DW$142, DW_AT_name("RampDelayMax")
    1397                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_RampDelayMax")
    1398                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1399                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401              $C$DW$143       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1403                      .dwattr $C$DW$143, DW_AT_name("RampLowLimit")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   27

    1404                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_RampLowLimit")
    1405                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1406                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408              $C$DW$144       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1410                      .dwattr $C$DW$144, DW_AT_name("RampHighLimit")
    1411                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_RampHighLimit")
    1412                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1413                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1414              
    1415              $C$DW$145       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$40)
    1417                      .dwattr $C$DW$145, DW_AT_name("RampDelayCount")
    1418                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_RampDelayCount")
    1419                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1420                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$146       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$146, DW_AT_name("SetpointValue")
    1425                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SetpointValue")
    1426                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1427                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$147       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$40)
    1431                      .dwattr $C$DW$147, DW_AT_name("EqualFlag")
    1432                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_EqualFlag")
    1433                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1434                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1435              
    1436              $C$DW$148       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1438                      .dwattr $C$DW$148, DW_AT_name("Tmp")
    1439                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Tmp")
    1440                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1441                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443                      .dwendtag $C$DW$T$47
    1444              
    1445              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1446                      .dwattr $C$DW$T$88, DW_AT_name("RMPCNTL")
    1447                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$47)
    1448                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1449              
    1450              
    1451              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1452                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x0c)
    1453              $C$DW$149       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1455                      .dwattr $C$DW$149, DW_AT_name("Freq")
    1456                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Freq")
    1457                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   28

    1459              
    1460              $C$DW$150       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$150, DW_AT_name("StepAngleMax")
    1463                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_StepAngleMax")
    1464                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1465                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467              $C$DW$151       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$151, DW_AT_name("Angle")
    1470                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Angle")
    1471                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1472                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1473              
    1474              $C$DW$152       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1476                      .dwattr $C$DW$152, DW_AT_name("Gain")
    1477                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Gain")
    1478                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1479                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1480              
    1481              $C$DW$153       .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1483                      .dwattr $C$DW$153, DW_AT_name("Out")
    1484                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Out")
    1485                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1486                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1487              
    1488              $C$DW$154       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$154, DW_AT_name("Offset")
    1491                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Offset")
    1492                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1493                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1494              
    1495                      .dwendtag $C$DW$T$48
    1496              
    1497              $C$DW$T$89      .dwtag  DW_TAG_typedef
    1498                      .dwattr $C$DW$T$89, DW_AT_name("RAMPGEN")
    1499                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    1500                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1501              
    1502              
    1503              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1504                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x16)
    1505              $C$DW$155       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$155, DW_AT_name("DcBusVolt")
    1508                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DcBusVolt")
    1509                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1511              
    1512              $C$DW$156       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   29

    1514                      .dwattr $C$DW$156, DW_AT_name("MfuncV1")
    1515                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_MfuncV1")
    1516                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1517                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1518              
    1519              $C$DW$157       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1521                      .dwattr $C$DW$157, DW_AT_name("MfuncV2")
    1522                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MfuncV2")
    1523                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1524                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1525              
    1526              $C$DW$158       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1528                      .dwattr $C$DW$158, DW_AT_name("MfuncV3")
    1529                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_MfuncV3")
    1530                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1531                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1532              
    1533              $C$DW$159       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$45)
    1535                      .dwattr $C$DW$159, DW_AT_name("OutOfPhase")
    1536                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_OutOfPhase")
    1537                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1538                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1539              
    1540              $C$DW$160       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$160, DW_AT_name("VphaseA")
    1543                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_VphaseA")
    1544                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1545                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547              $C$DW$161       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$161, DW_AT_name("VphaseB")
    1550                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_VphaseB")
    1551                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1552                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1553              
    1554              $C$DW$162       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1556                      .dwattr $C$DW$162, DW_AT_name("VphaseC")
    1557                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_VphaseC")
    1558                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1559                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1560              
    1561              $C$DW$163       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1563                      .dwattr $C$DW$163, DW_AT_name("Valpha")
    1564                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_Valpha")
    1565                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1566                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1567              
    1568              $C$DW$164       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   30

    1569                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1570                      .dwattr $C$DW$164, DW_AT_name("Vbeta")
    1571                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_Vbeta")
    1572                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1573                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1574              
    1575              $C$DW$165       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1577                      .dwattr $C$DW$165, DW_AT_name("temp")
    1578                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_temp")
    1579                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1580                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582                      .dwendtag $C$DW$T$49
    1583              
    1584              $C$DW$T$90      .dwtag  DW_TAG_typedef
    1585                      .dwattr $C$DW$T$90, DW_AT_name("PHASEVOLTAGE")
    1586                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$49)
    1587                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1588              
    1589              
    1590              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1591                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x0e)
    1592              $C$DW$166       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$50)
    1594                      .dwattr $C$DW$166, DW_AT_name("Rs")
    1595                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Rs")
    1596                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1597                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1598              
    1599              $C$DW$167       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$50)
    1601                      .dwattr $C$DW$167, DW_AT_name("Ls")
    1602                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Ls")
    1603                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1604                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$168       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$50)
    1608                      .dwattr $C$DW$168, DW_AT_name("Ib")
    1609                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Ib")
    1610                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1611                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1612              
    1613              $C$DW$169       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$50)
    1615                      .dwattr $C$DW$169, DW_AT_name("Vb")
    1616                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Vb")
    1617                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1618                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620              $C$DW$170       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$50)
    1622                      .dwattr $C$DW$170, DW_AT_name("Ts")
    1623                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_Ts")
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   31

    1624                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1625                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$171       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$50)
    1629                      .dwattr $C$DW$171, DW_AT_name("Fsmopos")
    1630                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_Fsmopos")
    1631                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1632                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1633              
    1634              $C$DW$172       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$50)
    1636                      .dwattr $C$DW$172, DW_AT_name("Gsmopos")
    1637                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Gsmopos")
    1638                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1639                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1640              
    1641                      .dwendtag $C$DW$T$51
    1642              
    1643              $C$DW$T$91      .dwtag  DW_TAG_typedef
    1644                      .dwattr $C$DW$T$91, DW_AT_name("SMOPOS_CONST")
    1645                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$51)
    1646                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1647              
    1648              
    1649              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1650                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
    1651              $C$DW$173       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$173, DW_AT_name("Valpha")
    1654                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_Valpha")
    1655                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$174       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$174, DW_AT_name("Ealpha")
    1661                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_Ealpha")
    1662                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1663                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$175       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$175, DW_AT_name("Zalpha")
    1668                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Zalpha")
    1669                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1670                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$176       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$176, DW_AT_name("Gsmopos")
    1675                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Gsmopos")
    1676                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1677                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1678              
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   32

    1679              $C$DW$177       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$177, DW_AT_name("EstIalpha")
    1682                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_EstIalpha")
    1683                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1684                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$178       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$178, DW_AT_name("Fsmopos")
    1689                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Fsmopos")
    1690                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1691                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1692              
    1693              $C$DW$179       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1695                      .dwattr $C$DW$179, DW_AT_name("Vbeta")
    1696                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Vbeta")
    1697                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1698                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1699              
    1700              $C$DW$180       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$180, DW_AT_name("Ebeta")
    1703                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Ebeta")
    1704                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1705                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1706              
    1707              $C$DW$181       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$181, DW_AT_name("Zbeta")
    1710                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Zbeta")
    1711                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1712                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714              $C$DW$182       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$182, DW_AT_name("EstIbeta")
    1717                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_EstIbeta")
    1718                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1719                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721              $C$DW$183       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$183, DW_AT_name("Ialpha")
    1724                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Ialpha")
    1725                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1726                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1727              
    1728              $C$DW$184       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$184, DW_AT_name("IalphaError")
    1731                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_IalphaError")
    1732                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1733                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Wed Jan 11 17:05:06 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   33

    1734              
    1735              $C$DW$185       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1737                      .dwattr $C$DW$185, DW_AT_name("Kslide")
    1738                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_Kslide")
    1739                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1740                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742              $C$DW$186       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$186, DW_AT_name("Ibeta")
    1745                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_Ibeta")
    1746                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
