TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.5.LTS *
       3              ;* Date/Time created: Mon Feb 20 15:12:50 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../drv8305.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\jason\workspace_v10_4\MonoMtrServo_379D\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DRV8305_SPI_Write")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8305_SPI_Write")

     622 00000102 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |158| 
     623                      .dwpsn  file "../drv8305.c",line 157,column 2,is_stmt,isa 0
     624 00000103 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |157| 
     625                      .dwpsn  file "../drv8305.c",line 158,column 2,is_stmt,isa 0
     626 00000104 9A02          MOVB      AL,#2                 ; [CPU_ALU] |158| 
     627              $C$DW$40        .dwtag  DW_TAG_TI_branch
     628                      .dwattr $C$DW$40, DW_AT_low_pc(0x00)
     629                      .dwattr $C$DW$40, DW_AT_name("_DRV8305_SPI_Read")
     630                      .dwattr $C$DW$40, DW_AT_TI_call
     631              
     632 00000105 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |158| 
         00000106 0000 
     633                      ; call occurs [#_DRV8305_SPI_Read] ; [] |158| 
     634 00000107 8D00          MOVL      XAR0,#481             ; [CPU_ALU] |158| 
         00000108 01E1 
     635 00000109 CCA9          AND       AL,AL,#0x07e7         ; [CPU_ALU] |158| 
         0000010a 07E7 
     636                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     637 0000010b 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |159| 
     638                      .dwpsn  file "../drv8305.c",line 158,column 2,is_stmt,isa 0
     639 0000010c 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |158| 
     640                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   14

     641 0000010d 9A03          MOVB      AL,#3                 ; [CPU_ALU] |159| 
     642              $C$DW$41        .dwtag  DW_TAG_TI_branch
     643                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     644                      .dwattr $C$DW$41, DW_AT_name("_DRV8305_SPI_Read")
     645                      .dwattr $C$DW$41, DW_AT_TI_call
     646              
     647 0000010e 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |159| 
         0000010f 0000 
     648                      ; call occurs [#_DRV8305_SPI_Read] ; [] |159| 
     649 00000110 8D00          MOVL      XAR0,#482             ; [CPU_ALU] |159| 
         00000111 01E2 
     650 00000112 CCA9          AND       AL,AL,#0x0777         ; [CPU_ALU] |159| 
         00000113 0777 
     651                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     652 00000114 8AA1          MOVL      XAR4,XAR1             ; [CPU_ALU] |160| 
     653                      .dwpsn  file "../drv8305.c",line 159,column 2,is_stmt,isa 0
     654 00000115 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |159| 
     655                      .dwpsn  file "../drv8305.c",line 160,column 2,is_stmt,isa 0
     656 00000116 9A04          MOVB      AL,#4                 ; [CPU_ALU] |160| 
     657              $C$DW$42        .dwtag  DW_TAG_TI_branch
     658                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     659                      .dwattr $C$DW$42, DW_AT_name("_DRV8305_SPI_Read")
     660                      .dwattr $C$DW$42, DW_AT_TI_call
     661              
     662 00000117 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_ALU] |160| 
         00000118 0000 
     663                      ; call occurs [#_DRV8305_SPI_Read] ; [] |160| 
     664 00000119 8D00          MOVL      XAR0,#483             ; [CPU_ALU] |160| 
         0000011a 01E3 
     665 0000011b CCA9          AND       AL,AL,#0x07e0         ; [CPU_ALU] |160| 
         0000011c 07E0 
     666 0000011d 9691          MOV       *+XAR1[AR0],AL        ; [CPU_ALU] |160| 
     667 0000011e 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     668                      .dwcfi  cfa_offset, -2
     669                      .dwcfi  restore_reg, 7
     670              $C$DW$43        .dwtag  DW_TAG_TI_branch
     671                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
     672                      .dwattr $C$DW$43, DW_AT_TI_return
     673              
     674 0000011f 0006          LRETR     ; [CPU_ALU] 
     675                      ; return occurs ; [] 
     676                      .dwattr $C$DW$36, DW_AT_TI_end_file("../drv8305.c")
     677                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xb7)
     678                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
     679                      .dwendentry
     680                      .dwendtag $C$DW$36
     681              
     682              ;**************************************************************
     683              ;* UNDEFINED EXTERNAL REFERENCES                              *
     684              ;**************************************************************
     685                      .global _DRV8305_SPI_Write
     686                      .global _DRV8305_SPI_Read
     687              
     688              ;***************************************************************
     689              ;* TYPE INFORMATION                                            *
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   15

     690              ;***************************************************************
     691              
     692              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     693                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     694              $C$DW$44        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$44, DW_AT_name("As")
     697                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_As")
     698                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$45        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     703                      .dwattr $C$DW$45, DW_AT_name("Bs")
     704                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Bs")
     705                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     706                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     707              
     708              $C$DW$46        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$46, DW_AT_name("Cs")
     711                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Cs")
     712                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     713                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     714              
     715              $C$DW$47        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     717                      .dwattr $C$DW$47, DW_AT_name("Alpha")
     718                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Alpha")
     719                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     720                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     721              
     722              $C$DW$48        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     724                      .dwattr $C$DW$48, DW_AT_name("Beta")
     725                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Beta")
     726                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     727                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     728              
     729                      .dwendtag $C$DW$T$20
     730              
     731              $C$DW$T$80      .dwtag  DW_TAG_typedef
     732                      .dwattr $C$DW$T$80, DW_AT_name("CLARKE")
     733                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$20)
     734                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     735              
     736              
     737              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     738                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     739              $C$DW$49        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$49, DW_AT_name("Alpha")
     742                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Alpha")
     743                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   16

     745              
     746              $C$DW$50        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     748                      .dwattr $C$DW$50, DW_AT_name("Beta")
     749                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Beta")
     750                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     751                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     752              
     753              $C$DW$51        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     755                      .dwattr $C$DW$51, DW_AT_name("Angle")
     756                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Angle")
     757                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     758                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     759              
     760              $C$DW$52        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$52, DW_AT_name("Ds")
     763                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ds")
     764                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     765                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     766              
     767              $C$DW$53        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$53, DW_AT_name("Qs")
     770                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Qs")
     771                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     772                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     773              
     774              $C$DW$54        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$54, DW_AT_name("Sine")
     777                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Sine")
     778                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     779                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     780              
     781              $C$DW$55        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$55, DW_AT_name("Cosine")
     784                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cosine")
     785                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     786                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     787              
     788                      .dwendtag $C$DW$T$21
     789              
     790              $C$DW$T$81      .dwtag  DW_TAG_typedef
     791                      .dwattr $C$DW$T$81, DW_AT_name("PARK")
     792                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$21)
     793                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     794              
     795              
     796              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     797                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     798              $C$DW$56        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   17

     800                      .dwattr $C$DW$56, DW_AT_name("Alpha")
     801                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
     802                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     804              
     805              $C$DW$57        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$57, DW_AT_name("Beta")
     808                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
     809                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     810                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     811              
     812              $C$DW$58        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$58, DW_AT_name("Angle")
     815                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Angle")
     816                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     817                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     818              
     819              $C$DW$59        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$59, DW_AT_name("Ds")
     822                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Ds")
     823                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     824                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     825              
     826              $C$DW$60        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$60, DW_AT_name("Qs")
     829                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Qs")
     830                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     831                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     832              
     833              $C$DW$61        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$61, DW_AT_name("Sine")
     836                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Sine")
     837                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     838                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     839              
     840              $C$DW$62        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$62, DW_AT_name("Cosine")
     843                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Cosine")
     844                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     845                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     846              
     847                      .dwendtag $C$DW$T$22
     848              
     849              $C$DW$T$82      .dwtag  DW_TAG_typedef
     850                      .dwattr $C$DW$T$82, DW_AT_name("IPARK")
     851                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$22)
     852                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
     853              
     854              
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   18

     855              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     856                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     857              $C$DW$63        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$63, DW_AT_name("Ref")
     860                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Ref")
     861                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     863              
     864              $C$DW$64        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$64, DW_AT_name("Fbk")
     867                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Fbk")
     868                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     869                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     870              
     871              $C$DW$65        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$65, DW_AT_name("Out")
     874                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Out")
     875                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     876                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     877              
     878              $C$DW$66        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$66, DW_AT_name("Kp")
     881                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Kp")
     882                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     883                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$67        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$67, DW_AT_name("Ki")
     888                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ki")
     889                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     890                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$68        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$68, DW_AT_name("Umax")
     895                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Umax")
     896                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     897                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$69        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$69, DW_AT_name("Umin")
     902                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Umin")
     903                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     904                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$70        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$70, DW_AT_name("up")
     909                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_up")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   19

     910                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     911                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     912              
     913              $C$DW$71        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$71, DW_AT_name("ui")
     916                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ui")
     917                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     918                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920              $C$DW$72        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$72, DW_AT_name("v1")
     923                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_v1")
     924                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     925                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$73        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$73, DW_AT_name("i1")
     930                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_i1")
     931                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     932                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934              $C$DW$74        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$74, DW_AT_name("w1")
     937                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_w1")
     938                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     939                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941                      .dwendtag $C$DW$T$23
     942              
     943              $C$DW$T$83      .dwtag  DW_TAG_typedef
     944                      .dwattr $C$DW$T$83, DW_AT_name("PI_CONTROLLER")
     945                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$23)
     946                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
     947              
     948              
     949              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     950                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     951              $C$DW$75        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$75, DW_AT_name("Ref")
     954                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Ref")
     955                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$76        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$76, DW_AT_name("Fbk")
     961                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Fbk")
     962                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     963                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     964              
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   20

     965              $C$DW$77        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$77, DW_AT_name("Out")
     968                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Out")
     969                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     970                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$78        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$78, DW_AT_name("c1")
     975                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_c1")
     976                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     977                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     978              
     979              $C$DW$79        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$79, DW_AT_name("c2")
     982                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_c2")
     983                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     984                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986                      .dwendtag $C$DW$T$24
     987              
     988              $C$DW$T$27      .dwtag  DW_TAG_typedef
     989                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
     990                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     991                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     992              
     993              
     994              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     995                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     996              $C$DW$80        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$80, DW_AT_name("Kr")
     999                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Kr")
    1000                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1002              
    1003              $C$DW$81        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$81, DW_AT_name("Kp")
    1006                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Kp")
    1007                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1008                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$82        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$82, DW_AT_name("Ki")
    1013                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Ki")
    1014                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1015                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$83        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$83, DW_AT_name("Kd")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   21

    1020                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Kd")
    1021                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1022                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1023              
    1024              $C$DW$84        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$84, DW_AT_name("Km")
    1027                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Km")
    1028                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1029                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1030              
    1031              $C$DW$85        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$85, DW_AT_name("Umax")
    1034                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Umax")
    1035                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1036                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1037              
    1038              $C$DW$86        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$86, DW_AT_name("Umin")
    1041                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Umin")
    1042                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1043                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045                      .dwendtag $C$DW$T$25
    1046              
    1047              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1048                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
    1049                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1050                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1051              
    1052              
    1053              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1054                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    1055              $C$DW$87        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$87, DW_AT_name("up")
    1058                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_up")
    1059                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$88        .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$88, DW_AT_name("ui")
    1065                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ui")
    1066                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1067                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$89        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$89, DW_AT_name("ud")
    1072                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ud")
    1073                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1074                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   22

    1075              
    1076              $C$DW$90        .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$90, DW_AT_name("v1")
    1079                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_v1")
    1080                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1081                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1082              
    1083              $C$DW$91        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$91, DW_AT_name("i1")
    1086                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_i1")
    1087                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1088                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1089              
    1090              $C$DW$92        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$92, DW_AT_name("d1")
    1093                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_d1")
    1094                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1095                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1096              
    1097              $C$DW$93        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$93, DW_AT_name("d2")
    1100                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_d2")
    1101                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1102                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1103              
    1104              $C$DW$94        .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$94, DW_AT_name("w1")
    1107                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_w1")
    1108                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1109                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111                      .dwendtag $C$DW$T$26
    1112              
    1113              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1114                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
    1115                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1116                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1117              
    1118              
    1119              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1120                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    1121              $C$DW$95        .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$27)
    1123                      .dwattr $C$DW$95, DW_AT_name("term")
    1124                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_term")
    1125                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$96        .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   23

    1130                      .dwattr $C$DW$96, DW_AT_name("param")
    1131                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_param")
    1132                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1133                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$97        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1137                      .dwattr $C$DW$97, DW_AT_name("data")
    1138                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_data")
    1139                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1140                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1141              
    1142                      .dwendtag $C$DW$T$30
    1143              
    1144              $C$DW$T$84      .dwtag  DW_TAG_typedef
    1145                      .dwattr $C$DW$T$84, DW_AT_name("PID_CONTROLLER")
    1146                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$30)
    1147                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1148              
    1149              
    1150              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1151                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    1152              $C$DW$98        .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$98, DW_AT_name("Ref")
    1155                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Ref")
    1156                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1158              
    1159              $C$DW$99        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$99, DW_AT_name("Fbk")
    1162                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Fbk")
    1163                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1164                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1165              
    1166              $C$DW$100       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$100, DW_AT_name("Out")
    1169                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Out")
    1170                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1171                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$101       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$101, DW_AT_name("c1")
    1176                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_c1")
    1177                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1178                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1179              
    1180              $C$DW$102       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$102, DW_AT_name("c2")
    1183                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_c2")
    1184                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   24

    1185                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187                      .dwendtag $C$DW$T$31
    1188              
    1189              $C$DW$T$34      .dwtag  DW_TAG_typedef
    1190                      .dwattr $C$DW$T$34, DW_AT_name("PI_TERMINALS")
    1191                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    1192                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1193              
    1194              
    1195              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1196                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
    1197              $C$DW$103       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$103, DW_AT_name("Kr")
    1200                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Kr")
    1201                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1203              
    1204              $C$DW$104       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$104, DW_AT_name("Kp")
    1207                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Kp")
    1208                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1209                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1210              
    1211              $C$DW$105       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$105, DW_AT_name("Ki")
    1214                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Ki")
    1215                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1216                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$106       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$106, DW_AT_name("Kd")
    1221                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Kd")
    1222                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1223                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1224              
    1225              $C$DW$107       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$107, DW_AT_name("Km")
    1228                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Km")
    1229                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1230                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1231              
    1232              $C$DW$108       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$108, DW_AT_name("Umax")
    1235                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Umax")
    1236                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1237                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1238              
    1239              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   25

    1240                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$109, DW_AT_name("Umin")
    1242                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Umin")
    1243                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1244                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1245              
    1246              $C$DW$110       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1248                      .dwattr $C$DW$110, DW_AT_name("T")
    1249                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_T")
    1250                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1251                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1252              
    1253              $C$DW$111       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$111, DW_AT_name("divT")
    1256                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_divT")
    1257                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1258                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1259              
    1260              $C$DW$112       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$112, DW_AT_name("Kt")
    1263                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_Kt")
    1264                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1265                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1266              
    1267                      .dwendtag $C$DW$T$32
    1268              
    1269              $C$DW$T$35      .dwtag  DW_TAG_typedef
    1270                      .dwattr $C$DW$T$35, DW_AT_name("PI_PARAMETERS")
    1271                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    1272                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1273              
    1274              
    1275              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1276                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    1277              $C$DW$113       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$113, DW_AT_name("up")
    1280                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_up")
    1281                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1283              
    1284              $C$DW$114       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$114, DW_AT_name("ui")
    1287                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_ui")
    1288                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1289                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1290              
    1291              $C$DW$115       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$115, DW_AT_name("v1")
    1294                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_v1")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   26

    1295                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1296                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$116       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$116, DW_AT_name("i1")
    1301                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_i1")
    1302                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1303                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1304              
    1305              $C$DW$117       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$117, DW_AT_name("w1")
    1308                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_w1")
    1309                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1310                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1311              
    1312                      .dwendtag $C$DW$T$33
    1313              
    1314              $C$DW$T$36      .dwtag  DW_TAG_typedef
    1315                      .dwattr $C$DW$T$36, DW_AT_name("PI_DATA")
    1316                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    1317                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1318              
    1319              
    1320              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1321                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x28)
    1322              $C$DW$118       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$34)
    1324                      .dwattr $C$DW$118, DW_AT_name("term")
    1325                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_term")
    1326                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1328              
    1329              $C$DW$119       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$35)
    1331                      .dwattr $C$DW$119, DW_AT_name("param")
    1332                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_param")
    1333                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1334                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$120       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$36)
    1338                      .dwattr $C$DW$120, DW_AT_name("data")
    1339                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_data")
    1340                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1341                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343                      .dwendtag $C$DW$T$37
    1344              
    1345              $C$DW$T$85      .dwtag  DW_TAG_typedef
    1346                      .dwattr $C$DW$T$85, DW_AT_name("PI_SPEED_CONTROLLER")
    1347                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$37)
    1348                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1349              
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   27

    1350              
    1351              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1352                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
    1353              $C$DW$121       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$16)
    1355                      .dwattr $C$DW$121, DW_AT_name("MechTheta")
    1356                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_MechTheta")
    1357                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$122       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$16)
    1362                      .dwattr $C$DW$122, DW_AT_name("OldMechTheta")
    1363                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_OldMechTheta")
    1364                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1365                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$123       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$16)
    1369                      .dwattr $C$DW$123, DW_AT_name("PosError")
    1370                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PosError")
    1371                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1372                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$124       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$16)
    1376                      .dwattr $C$DW$124, DW_AT_name("PosErrorKdDivJest")
    1377                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PosErrorKdDivJest")
    1378                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1379                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381              $C$DW$125       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$16)
    1383                      .dwattr $C$DW$125, DW_AT_name("PosErrorKp")
    1384                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PosErrorKp")
    1385                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1386                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1387              
    1388              $C$DW$126       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$16)
    1390                      .dwattr $C$DW$126, DW_AT_name("PosErrorKi")
    1391                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PosErrorKi")
    1392                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1393                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$127       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$16)
    1397                      .dwattr $C$DW$127, DW_AT_name("TorqueCmd")
    1398                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_TorqueCmd")
    1399                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1400                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$128       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$16)
    1404                      .dwattr $C$DW$128, DW_AT_name("D_est")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   28

    1405                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_D_est")
    1406                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1407                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1408              
    1409              $C$DW$129       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$16)
    1411                      .dwattr $C$DW$129, DW_AT_name("CurrentCmd")
    1412                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CurrentCmd")
    1413                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1414                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1415              
    1416              $C$DW$130       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$16)
    1418                      .dwattr $C$DW$130, DW_AT_name("AccEst")
    1419                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_AccEst")
    1420                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1421                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1422              
    1423              $C$DW$131       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$16)
    1425                      .dwattr $C$DW$131, DW_AT_name("Enhanced_SpeedEst")
    1426                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_Enhanced_SpeedEst")
    1427                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1428                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1429              
    1430              $C$DW$132       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$16)
    1432                      .dwattr $C$DW$132, DW_AT_name("Enhanced_SpeedEst_pu")
    1433                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_Enhanced_SpeedEst_pu")
    1434                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1435                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1436              
    1437              $C$DW$133       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$16)
    1439                      .dwattr $C$DW$133, DW_AT_name("SpeedEst")
    1440                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SpeedEst")
    1441                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1442                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$134       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$16)
    1446                      .dwattr $C$DW$134, DW_AT_name("PosEst")
    1447                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PosEst")
    1448                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1449                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451              $C$DW$135       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
    1453                      .dwattr $C$DW$135, DW_AT_name("SpeedRpm")
    1454                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SpeedRpm")
    1455                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1456                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1457              
    1458                      .dwendtag $C$DW$T$39
    1459              
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   29

    1460              $C$DW$T$42      .dwtag  DW_TAG_typedef
    1461                      .dwattr $C$DW$T$42, DW_AT_name("V_EST_TERMINALS")
    1462                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    1463                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1464              
    1465              
    1466              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1467                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1468              $C$DW$136       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$16)
    1470                      .dwattr $C$DW$136, DW_AT_name("Kd")
    1471                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Kd")
    1472                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$137       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$16)
    1477                      .dwattr $C$DW$137, DW_AT_name("Kp")
    1478                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_Kp")
    1479                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1480                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$138       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$16)
    1484                      .dwattr $C$DW$138, DW_AT_name("Ki")
    1485                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Ki")
    1486                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1487                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$139       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$16)
    1491                      .dwattr $C$DW$139, DW_AT_name("Kt")
    1492                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Kt")
    1493                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1494                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$140       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$16)
    1498                      .dwattr $C$DW$140, DW_AT_name("T_est")
    1499                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_T_est")
    1500                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1501                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$141       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$16)
    1505                      .dwattr $C$DW$141, DW_AT_name("f_est")
    1506                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_f_est")
    1507                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1508                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$142       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$16)
    1512                      .dwattr $C$DW$142, DW_AT_name("J_est")
    1513                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_J_est")
    1514                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   30

    1515                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$143       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$16)
    1519                      .dwattr $C$DW$143, DW_AT_name("divJ_est")
    1520                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_divJ_est")
    1521                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1522                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$144       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$40)
    1526                      .dwattr $C$DW$144, DW_AT_name("BaseRpm")
    1527                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_BaseRpm")
    1528                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1529                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531                      .dwendtag $C$DW$T$41
    1532              
    1533              $C$DW$T$43      .dwtag  DW_TAG_typedef
    1534                      .dwattr $C$DW$T$43, DW_AT_name("V_EST_PARAMETERS")
    1535                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$41)
    1536                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1537              
    1538              
    1539              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1540                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x30)
    1541              $C$DW$145       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$42)
    1543                      .dwattr $C$DW$145, DW_AT_name("term")
    1544                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_term")
    1545                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1547              
    1548              $C$DW$146       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$43)
    1550                      .dwattr $C$DW$146, DW_AT_name("param")
    1551                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_param")
    1552                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1553                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555                      .dwendtag $C$DW$T$44
    1556              
    1557              $C$DW$T$86      .dwtag  DW_TAG_typedef
    1558                      .dwattr $C$DW$T$86, DW_AT_name("V_ESTIMATOR")
    1559                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$44)
    1560                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1561              
    1562              
    1563              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1564                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    1565              $C$DW$147       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1567                      .dwattr $C$DW$147, DW_AT_name("Ualpha")
    1568                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_Ualpha")
    1569                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   31

    1570                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1571              
    1572              $C$DW$148       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1574                      .dwattr $C$DW$148, DW_AT_name("Ubeta")
    1575                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_Ubeta")
    1576                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1577                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1578              
    1579              $C$DW$149       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1581                      .dwattr $C$DW$149, DW_AT_name("Ta")
    1582                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Ta")
    1583                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1584                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1585              
    1586              $C$DW$150       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1588                      .dwattr $C$DW$150, DW_AT_name("Tb")
    1589                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Tb")
    1590                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1591                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1592              
    1593              $C$DW$151       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1595                      .dwattr $C$DW$151, DW_AT_name("Tc")
    1596                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Tc")
    1597                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1598                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$152       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$152, DW_AT_name("tmp1")
    1603                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_tmp1")
    1604                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1605                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1606              
    1607              $C$DW$153       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1609                      .dwattr $C$DW$153, DW_AT_name("tmp2")
    1610                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_tmp2")
    1611                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1612                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$154       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$154, DW_AT_name("tmp3")
    1617                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_tmp3")
    1618                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1619                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1620              
    1621              $C$DW$155       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$45)
    1623                      .dwattr $C$DW$155, DW_AT_name("VecSector")
    1624                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_VecSector")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   32

    1625                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1626                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1627              
    1628                      .dwendtag $C$DW$T$46
    1629              
    1630              $C$DW$T$87      .dwtag  DW_TAG_typedef
    1631                      .dwattr $C$DW$T$87, DW_AT_name("SVGEN")
    1632                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$46)
    1633                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1634              
    1635              
    1636              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1637                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    1638              $C$DW$156       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1640                      .dwattr $C$DW$156, DW_AT_name("TargetValue")
    1641                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_TargetValue")
    1642                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645              $C$DW$157       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$40)
    1647                      .dwattr $C$DW$157, DW_AT_name("RampDelayMax")
    1648                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RampDelayMax")
    1649                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1650                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1651              
    1652              $C$DW$158       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1654                      .dwattr $C$DW$158, DW_AT_name("RampLowLimit")
    1655                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_RampLowLimit")
    1656                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1657                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1658              
    1659              $C$DW$159       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$159, DW_AT_name("RampHighLimit")
    1662                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_RampHighLimit")
    1663                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1664                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1665              
    1666              $C$DW$160       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    1668                      .dwattr $C$DW$160, DW_AT_name("RampDelayCount")
    1669                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_RampDelayCount")
    1670                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1671                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1672              
    1673              $C$DW$161       .dwtag  DW_TAG_member
    1674                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1675                      .dwattr $C$DW$161, DW_AT_name("SetpointValue")
    1676                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SetpointValue")
    1677                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1678                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1679              
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   33

    1680              $C$DW$162       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    1682                      .dwattr $C$DW$162, DW_AT_name("EqualFlag")
    1683                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_EqualFlag")
    1684                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1685                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1686              
    1687              $C$DW$163       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$163, DW_AT_name("Tmp")
    1690                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_Tmp")
    1691                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1692                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1693              
    1694                      .dwendtag $C$DW$T$47
    1695              
    1696              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1697                      .dwattr $C$DW$T$88, DW_AT_name("RMPCNTL")
    1698                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$47)
    1699                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1700              
    1701              
    1702              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1703                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x0c)
    1704              $C$DW$164       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$164, DW_AT_name("Freq")
    1707                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_Freq")
    1708                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$165       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1713                      .dwattr $C$DW$165, DW_AT_name("StepAngleMax")
    1714                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_StepAngleMax")
    1715                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1716                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$166       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1720                      .dwattr $C$DW$166, DW_AT_name("Angle")
    1721                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Angle")
    1722                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1723                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$167       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$167, DW_AT_name("Gain")
    1728                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Gain")
    1729                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1730                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$168       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1734                      .dwattr $C$DW$168, DW_AT_name("Out")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   34

    1735                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Out")
    1736                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1737                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739              $C$DW$169       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$169, DW_AT_name("Offset")
    1742                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Offset")
    1743                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1744                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746                      .dwendtag $C$DW$T$48
    1747              
    1748              $C$DW$T$89      .dwtag  DW_TAG_typedef
    1749                      .dwattr $C$DW$T$89, DW_AT_name("RAMPGEN")
    1750                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$48)
    1751                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1752              
    1753              
    1754              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1755                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x16)
    1756              $C$DW$170       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$170, DW_AT_name("DcBusVolt")
    1759                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DcBusVolt")
    1760                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1762              
    1763              $C$DW$171       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$171, DW_AT_name("MfuncV1")
    1766                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_MfuncV1")
    1767                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1768                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$172       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$172, DW_AT_name("MfuncV2")
    1773                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_MfuncV2")
    1774                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1775                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1776              
    1777              $C$DW$173       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$173, DW_AT_name("MfuncV3")
    1780                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_MfuncV3")
    1781                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1782                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1783              
    1784              $C$DW$174       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$45)
    1786                      .dwattr $C$DW$174, DW_AT_name("OutOfPhase")
    1787                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_OutOfPhase")
    1788                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1789                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   35

    1790              
    1791              $C$DW$175       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1793                      .dwattr $C$DW$175, DW_AT_name("VphaseA")
    1794                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_VphaseA")
    1795                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1796                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1797              
    1798              $C$DW$176       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1800                      .dwattr $C$DW$176, DW_AT_name("VphaseB")
    1801                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_VphaseB")
    1802                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1803                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$177       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1807                      .dwattr $C$DW$177, DW_AT_name("VphaseC")
    1808                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_VphaseC")
    1809                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1810                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1811              
    1812              $C$DW$178       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$178, DW_AT_name("Valpha")
    1815                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Valpha")
    1816                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1817                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1818              
    1819              $C$DW$179       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1821                      .dwattr $C$DW$179, DW_AT_name("Vbeta")
    1822                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Vbeta")
    1823                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1824                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1825              
    1826              $C$DW$180       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1828                      .dwattr $C$DW$180, DW_AT_name("temp")
    1829                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_temp")
    1830                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1831                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833                      .dwendtag $C$DW$T$49
    1834              
    1835              $C$DW$T$90      .dwtag  DW_TAG_typedef
    1836                      .dwattr $C$DW$T$90, DW_AT_name("PHASEVOLTAGE")
    1837                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$49)
    1838                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1839              
    1840              
    1841              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1842                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x0e)
    1843              $C$DW$181       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   36

    1845                      .dwattr $C$DW$181, DW_AT_name("Rs")
    1846                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Rs")
    1847                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$182       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$50)
    1852                      .dwattr $C$DW$182, DW_AT_name("Ls")
    1853                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_Ls")
    1854                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1855                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1856              
    1857              $C$DW$183       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$50)
    1859                      .dwattr $C$DW$183, DW_AT_name("Ib")
    1860                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Ib")
    1861                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1862                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1863              
    1864              $C$DW$184       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$50)
    1866                      .dwattr $C$DW$184, DW_AT_name("Vb")
    1867                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_Vb")
    1868                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1869                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1870              
    1871              $C$DW$185       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$50)
    1873                      .dwattr $C$DW$185, DW_AT_name("Ts")
    1874                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_Ts")
    1875                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1876                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$186       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$50)
    1880                      .dwattr $C$DW$186, DW_AT_name("Fsmopos")
    1881                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_Fsmopos")
    1882                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1883                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885              $C$DW$187       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$50)
    1887                      .dwattr $C$DW$187, DW_AT_name("Gsmopos")
    1888                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_Gsmopos")
    1889                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1890                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892                      .dwendtag $C$DW$T$51
    1893              
    1894              $C$DW$T$91      .dwtag  DW_TAG_typedef
    1895                      .dwattr $C$DW$T$91, DW_AT_name("SMOPOS_CONST")
    1896                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$51)
    1897                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1898              
    1899              
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   37

    1900              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1901                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
    1902              $C$DW$188       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1904                      .dwattr $C$DW$188, DW_AT_name("Valpha")
    1905                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_Valpha")
    1906                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1908              
    1909              $C$DW$189       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$189, DW_AT_name("Ealpha")
    1912                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_Ealpha")
    1913                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1914                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1915              
    1916              $C$DW$190       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1918                      .dwattr $C$DW$190, DW_AT_name("Zalpha")
    1919                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_Zalpha")
    1920                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1921                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1922              
    1923              $C$DW$191       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$191, DW_AT_name("Gsmopos")
    1926                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_Gsmopos")
    1927                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1928                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1929              
    1930              $C$DW$192       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$192, DW_AT_name("EstIalpha")
    1933                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_EstIalpha")
    1934                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1935                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$193       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$193, DW_AT_name("Fsmopos")
    1940                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_Fsmopos")
    1941                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1942                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1943              
    1944              $C$DW$194       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1946                      .dwattr $C$DW$194, DW_AT_name("Vbeta")
    1947                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_Vbeta")
    1948                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1949                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1950              
    1951              $C$DW$195       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1953                      .dwattr $C$DW$195, DW_AT_name("Ebeta")
    1954                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_Ebeta")
TMS320C2000 Assembler PC v20.2.5 Mon Feb 20 15:12:50 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   38

    1955                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1956                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$196       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$196, DW_AT_name("Zbeta")
    1961                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_Zbeta")
    1962                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1963                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1964              
    1965              $C$DW$197       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$197, DW_AT_name("EstIbeta")
    1968                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EstIbeta")
    1969                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1970                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1971              
    1972              $C$DW$198       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1974                      .dwattr $C$DW$198, DW_AT_name("Ialpha")
    1975                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Ialpha")
    1976                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1977                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1978              
    1979              $C$DW$199       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1981                      .dwattr $C$DW$199, DW_AT_name("IalphaError")
    1982                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_IalphaError")
    1983                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1984                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1985              
    1986              $C$DW$200       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1988                      .dwattr $C$DW$200, DW_AT_name("Kslide")
    1989                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Kslide")
    1990                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1991                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993              $C$DW$201       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1995                      .dwattr $C$DW$201, DW_AT_name("Ibeta")
    1996                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Ibeta")
    1997                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1998                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1999              
    2000              $C$DW$202       .dwtag  DW_TAG_member
