TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.5.LTS *
       3              ;* Date/Time created: Fri Jan  6 17:23:28 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DRV830x_SPI.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\jason\workspace_v10_4\MonoMtrServo_379D\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_WritePin")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_WritePin")

     601 00000062 FE02          ADDB      SP,#2                 ; [CPU_ARAU] 
     602                      .dwcfi  cfa_offset, -8
     603                      .dwpsn  file "../DRV830x_SPI.c",line 111,column 2,is_stmt,isa 0
     604 00000063 5603          MOV       ACC,AL << #11         ; [CPU_ALU] |111| 
         00000064 0BA9 
     605                      .dwpsn  file "../DRV830x_SPI.c",line 115,column 2,is_stmt,isa 0
     606 00000065 D00A          MOVB      XAR0,#10              ; [CPU_ALU] |115| 
     607                      .dwpsn  file "../DRV830x_SPI.c",line 107,column 1,is_stmt,isa 0
     608 00000066 86A4          MOVL      XAR2,XAR4             ; [CPU_ALU] |107| 
     609                      .dwpsn  file "../DRV830x_SPI.c",line 115,column 2,is_stmt,isa 0
     610 00000067 D108          MOVB      XAR1,#8               ; [CPU_ALU] |115| 
     611                      .dwpsn  file "../DRV830x_SPI.c",line 111,column 2,is_stmt,isa 0
     612 00000068 1AA9          OR        AL,#0x8000            ; [CPU_ALU] |111| 
         00000069 8000 
     613 0000006a 9641          MOV       *-SP[1],AL            ; [CPU_ALU] |111| 
     614                      .dwpsn  file "../DRV830x_SPI.c",line 115,column 2,is_stmt,isa 0
     615 0000006b 9392          MOV       AH,*+XAR2[AR0]        ; [CPU_ALU] |115| 
     616 0000006c 8A9A          MOVL      XAR4,*+XAR2[AR1]      ; [CPU_ALU] |115| 
     617              $C$DW$49        .dwtag  DW_TAG_TI_branch
     618                      .dwattr $C$DW$49, DW_AT_low_pc(0x00)
     619                      .dwattr $C$DW$49, DW_AT_name("_SPI_Driver")
     620                      .dwattr $C$DW$49, DW_AT_TI_call
     621              
     622 0000006d 7640'         LCR       #_SPI_Driver          ; [CPU_ALU] |115| 
         0000006e 0000 
     623                      ; call occurs [#_SPI_Driver] ; [] |115| 
     624 0000006f 9642          MOV       *-SP[2],AL            ; [CPU_ALU] |115| 
     625                      .dwpsn  file "../DRV830x_SPI.c",line 116,column 2,is_stmt,isa 0
     626 00000070 0226          MOVB      ACC,#38               ; [CPU_ALU] |116| 
     627              $C$DW$50        .dwtag  DW_TAG_TI_branch
     628                      .dwattr $C$DW$50, DW_AT_low_pc(0x00)
     629                      .dwattr $C$DW$50, DW_AT_name("_F28x_usDelay")
     630                      .dwattr $C$DW$50, DW_AT_TI_call
     631              
     632 00000071 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |116| 
         00000072 0000 
     633                      ; call occurs [#_F28x_usDelay] ; [] |116| 
     634                      .dwpsn  file "../DRV830x_SPI.c",line 117,column 2,is_stmt,isa 0
     635 00000073 D108          MOVB      XAR1,#8               ; [CPU_ALU] |117| 
     636 00000074 D00A          MOVB      XAR0,#10              ; [CPU_ALU] |117| 
     637 00000075 9A00          MOVB      AL,#0                 ; [CPU_ALU] |117| 
     638 00000076 8A9A          MOVL      XAR4,*+XAR2[AR1]      ; [CPU_ALU] |117| 
     639 00000077 9392          MOV       AH,*+XAR2[AR0]        ; [CPU_ALU] |117| 
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   13

     640              $C$DW$51        .dwtag  DW_TAG_TI_branch
     641                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     642                      .dwattr $C$DW$51, DW_AT_name("_SPI_Driver")
     643                      .dwattr $C$DW$51, DW_AT_TI_call
     644              
     645 00000078 7640'         LCR       #_SPI_Driver          ; [CPU_ALU] |117| 
         00000079 0000 
     646                      ; call occurs [#_SPI_Driver] ; [] |117| 
     647 0000007a FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     648                      .dwcfi  cfa_offset, -6
     649 0000007b 86BE          MOVL      XAR2,*--SP            ; [CPU_ALU] 
     650                      .dwcfi  cfa_offset, -4
     651                      .dwcfi  restore_reg, 9
     652 0000007c 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     653                      .dwcfi  cfa_offset, -2
     654                      .dwcfi  restore_reg, 7
     655              $C$DW$52        .dwtag  DW_TAG_TI_branch
     656                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     657                      .dwattr $C$DW$52, DW_AT_TI_return
     658              
     659 0000007d 0006          LRETR     ; [CPU_ALU] 
     660                      ; return occurs ; [] 
     661                      .dwattr $C$DW$42, DW_AT_TI_end_file("../DRV830x_SPI.c")
     662                      .dwattr $C$DW$42, DW_AT_TI_end_line(0x76)
     663                      .dwattr $C$DW$42, DW_AT_TI_end_column(0x01)
     664                      .dwendentry
     665                      .dwendtag $C$DW$42
     666              
     667              ;**************************************************************
     668              ;* UNDEFINED EXTERNAL REFERENCES                              *
     669              ;**************************************************************
     670                      .global _GPIO_WritePin
     671                      .global _F28x_usDelay
     672              
     673              ;***************************************************************
     674              ;* TYPE INFORMATION                                            *
     675              ;***************************************************************
     676              
     677              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     678                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     679              $C$DW$53        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$53, DW_AT_name("As")
     682                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_As")
     683                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     685              
     686              $C$DW$54        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$54, DW_AT_name("Bs")
     689                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Bs")
     690                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     691                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     692              
     693              $C$DW$55        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   14

     694                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$55, DW_AT_name("Cs")
     696                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cs")
     697                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     698                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     699              
     700              $C$DW$56        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$56, DW_AT_name("Alpha")
     703                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
     704                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     705                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     706              
     707              $C$DW$57        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$57, DW_AT_name("Beta")
     710                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
     711                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     712                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     713              
     714                      .dwendtag $C$DW$T$20
     715              
     716              $C$DW$T$75      .dwtag  DW_TAG_typedef
     717                      .dwattr $C$DW$T$75, DW_AT_name("CLARKE")
     718                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$20)
     719                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     720              
     721              
     722              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     723                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     724              $C$DW$58        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$58, DW_AT_name("Alpha")
     727                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Alpha")
     728                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     730              
     731              $C$DW$59        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     733                      .dwattr $C$DW$59, DW_AT_name("Beta")
     734                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Beta")
     735                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     736                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$60        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$60, DW_AT_name("Angle")
     741                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Angle")
     742                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     743                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     744              
     745              $C$DW$61        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$61, DW_AT_name("Ds")
     748                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Ds")
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   15

     749                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     750                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     751              
     752              $C$DW$62        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$62, DW_AT_name("Qs")
     755                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Qs")
     756                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     757                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     758              
     759              $C$DW$63        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$63, DW_AT_name("Sine")
     762                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Sine")
     763                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     764                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$64        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$64, DW_AT_name("Cosine")
     769                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Cosine")
     770                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     771                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     772              
     773                      .dwendtag $C$DW$T$21
     774              
     775              $C$DW$T$76      .dwtag  DW_TAG_typedef
     776                      .dwattr $C$DW$T$76, DW_AT_name("PARK")
     777                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$21)
     778                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
     779              
     780              
     781              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     782                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     783              $C$DW$65        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$65, DW_AT_name("Alpha")
     786                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Alpha")
     787                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     789              
     790              $C$DW$66        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$66, DW_AT_name("Beta")
     793                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Beta")
     794                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     795                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$67        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$67, DW_AT_name("Angle")
     800                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Angle")
     801                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     802                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     803              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   16

     804              $C$DW$68        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$68, DW_AT_name("Ds")
     807                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Ds")
     808                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     809                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$69        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$69, DW_AT_name("Qs")
     814                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Qs")
     815                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     816                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818              $C$DW$70        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$70, DW_AT_name("Sine")
     821                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Sine")
     822                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     823                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     824              
     825              $C$DW$71        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$71, DW_AT_name("Cosine")
     828                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Cosine")
     829                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     830                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     831              
     832                      .dwendtag $C$DW$T$22
     833              
     834              $C$DW$T$77      .dwtag  DW_TAG_typedef
     835                      .dwattr $C$DW$T$77, DW_AT_name("IPARK")
     836                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$22)
     837                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     838              
     839              
     840              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     841                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     842              $C$DW$72        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$72, DW_AT_name("Ref")
     845                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Ref")
     846                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     848              
     849              $C$DW$73        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$73, DW_AT_name("Fbk")
     852                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Fbk")
     853                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     854                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$74        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$74, DW_AT_name("Out")
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   17

     859                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Out")
     860                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     861                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     862              
     863              $C$DW$75        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     865                      .dwattr $C$DW$75, DW_AT_name("Kp")
     866                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Kp")
     867                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     868                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     869              
     870              $C$DW$76        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$76, DW_AT_name("Ki")
     873                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Ki")
     874                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     875                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     876              
     877              $C$DW$77        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$77, DW_AT_name("Umax")
     880                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Umax")
     881                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     882                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     883              
     884              $C$DW$78        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$78, DW_AT_name("Umin")
     887                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Umin")
     888                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     889                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     890              
     891              $C$DW$79        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$79, DW_AT_name("up")
     894                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_up")
     895                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     896                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     897              
     898              $C$DW$80        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$80, DW_AT_name("ui")
     901                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ui")
     902                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     903                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     904              
     905              $C$DW$81        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$81, DW_AT_name("v1")
     908                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_v1")
     909                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     910                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     911              
     912              $C$DW$82        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   18

     914                      .dwattr $C$DW$82, DW_AT_name("i1")
     915                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_i1")
     916                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     917                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     918              
     919              $C$DW$83        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$83, DW_AT_name("w1")
     922                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_w1")
     923                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     924                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926                      .dwendtag $C$DW$T$23
     927              
     928              $C$DW$T$78      .dwtag  DW_TAG_typedef
     929                      .dwattr $C$DW$T$78, DW_AT_name("PI_CONTROLLER")
     930                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$23)
     931                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     932              
     933              
     934              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     935                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     936              $C$DW$84        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$84, DW_AT_name("Ref")
     939                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ref")
     940                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     942              
     943              $C$DW$85        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$85, DW_AT_name("Fbk")
     946                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Fbk")
     947                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     948                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$86        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$86, DW_AT_name("Out")
     953                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Out")
     954                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     955                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     956              
     957              $C$DW$87        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$87, DW_AT_name("c1")
     960                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_c1")
     961                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     962                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     963              
     964              $C$DW$88        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$88, DW_AT_name("c2")
     967                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_c2")
     968                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   19

     969                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     970              
     971                      .dwendtag $C$DW$T$24
     972              
     973              $C$DW$T$27      .dwtag  DW_TAG_typedef
     974                      .dwattr $C$DW$T$27, DW_AT_name("PID_TERMINALS")
     975                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     976                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     977              
     978              
     979              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     980                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     981              $C$DW$89        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$89, DW_AT_name("Kr")
     984                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Kr")
     985                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     987              
     988              $C$DW$90        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$90, DW_AT_name("Kp")
     991                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Kp")
     992                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     993                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$91        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$91, DW_AT_name("Ki")
     998                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Ki")
     999                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1000                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1001              
    1002              $C$DW$92        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$92, DW_AT_name("Kd")
    1005                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Kd")
    1006                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1007                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1008              
    1009              $C$DW$93        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$93, DW_AT_name("Km")
    1012                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Km")
    1013                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1014                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1015              
    1016              $C$DW$94        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$94, DW_AT_name("Umax")
    1019                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Umax")
    1020                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1021                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1022              
    1023              $C$DW$95        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   20

    1024                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$95, DW_AT_name("Umin")
    1026                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Umin")
    1027                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1028                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1029              
    1030                      .dwendtag $C$DW$T$25
    1031              
    1032              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1033                      .dwattr $C$DW$T$28, DW_AT_name("PID_PARAMETERS")
    1034                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1035                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1036              
    1037              
    1038              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1039                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    1040              $C$DW$96        .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$96, DW_AT_name("up")
    1043                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_up")
    1044                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1046              
    1047              $C$DW$97        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$97, DW_AT_name("ui")
    1050                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ui")
    1051                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1052                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1053              
    1054              $C$DW$98        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$98, DW_AT_name("ud")
    1057                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ud")
    1058                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1059                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1060              
    1061              $C$DW$99        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$99, DW_AT_name("v1")
    1064                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_v1")
    1065                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1066                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1067              
    1068              $C$DW$100       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$100, DW_AT_name("i1")
    1071                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_i1")
    1072                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1073                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$101       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$101, DW_AT_name("d1")
    1078                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_d1")
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   21

    1079                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1080                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$102       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$102, DW_AT_name("d2")
    1085                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_d2")
    1086                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1087                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089              $C$DW$103       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$103, DW_AT_name("w1")
    1092                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_w1")
    1093                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1094                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096                      .dwendtag $C$DW$T$26
    1097              
    1098              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1099                      .dwattr $C$DW$T$29, DW_AT_name("PID_DATA")
    1100                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1101                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1102              
    1103              
    1104              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1105                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    1106              $C$DW$104       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    1108                      .dwattr $C$DW$104, DW_AT_name("term")
    1109                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_term")
    1110                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1112              
    1113              $C$DW$105       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1115                      .dwattr $C$DW$105, DW_AT_name("param")
    1116                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_param")
    1117                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1118                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120              $C$DW$106       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1122                      .dwattr $C$DW$106, DW_AT_name("data")
    1123                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_data")
    1124                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1125                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127                      .dwendtag $C$DW$T$30
    1128              
    1129              $C$DW$T$79      .dwtag  DW_TAG_typedef
    1130                      .dwattr $C$DW$T$79, DW_AT_name("PID_CONTROLLER")
    1131                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$30)
    1132                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1133              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   22

    1134              
    1135              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1136                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    1137              $C$DW$107       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$107, DW_AT_name("Ref")
    1140                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Ref")
    1141                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$108       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$108, DW_AT_name("Fbk")
    1147                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Fbk")
    1148                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1149                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$109       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$109, DW_AT_name("Out")
    1154                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Out")
    1155                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1156                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$110       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$110, DW_AT_name("c1")
    1161                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_c1")
    1162                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1163                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$111       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$111, DW_AT_name("c2")
    1168                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_c2")
    1169                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1170                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172                      .dwendtag $C$DW$T$31
    1173              
    1174              $C$DW$T$34      .dwtag  DW_TAG_typedef
    1175                      .dwattr $C$DW$T$34, DW_AT_name("PI_TERMINALS")
    1176                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    1177                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1178              
    1179              
    1180              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1181                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
    1182              $C$DW$112       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$112, DW_AT_name("Kr")
    1185                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_Kr")
    1186                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1188              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   23

    1189              $C$DW$113       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$113, DW_AT_name("Kp")
    1192                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_Kp")
    1193                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1194                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1195              
    1196              $C$DW$114       .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$114, DW_AT_name("Ki")
    1199                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_Ki")
    1200                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1201                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1202              
    1203              $C$DW$115       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$115, DW_AT_name("Kd")
    1206                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Kd")
    1207                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1208                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1209              
    1210              $C$DW$116       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$116, DW_AT_name("Km")
    1213                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_Km")
    1214                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1215                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1216              
    1217              $C$DW$117       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$117, DW_AT_name("Umax")
    1220                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Umax")
    1221                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1222                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1223              
    1224              $C$DW$118       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$118, DW_AT_name("Umin")
    1227                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Umin")
    1228                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1229                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1230              
    1231              $C$DW$119       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$119, DW_AT_name("T")
    1234                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_T")
    1235                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1236                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$120       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1240                      .dwattr $C$DW$120, DW_AT_name("divT")
    1241                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_divT")
    1242                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1243                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   24

    1244              
    1245              $C$DW$121       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$121, DW_AT_name("Kt")
    1248                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_Kt")
    1249                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1250                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1251              
    1252                      .dwendtag $C$DW$T$32
    1253              
    1254              $C$DW$T$35      .dwtag  DW_TAG_typedef
    1255                      .dwattr $C$DW$T$35, DW_AT_name("PI_PARAMETERS")
    1256                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    1257                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1258              
    1259              
    1260              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1261                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    1262              $C$DW$122       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$122, DW_AT_name("up")
    1265                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_up")
    1266                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$123       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$123, DW_AT_name("ui")
    1272                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ui")
    1273                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1274                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$124       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$124, DW_AT_name("v1")
    1279                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_v1")
    1280                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1281                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283              $C$DW$125       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1285                      .dwattr $C$DW$125, DW_AT_name("i1")
    1286                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_i1")
    1287                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1288                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$126       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$126, DW_AT_name("w1")
    1293                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_w1")
    1294                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1295                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297                      .dwendtag $C$DW$T$33
    1298              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   25

    1299              $C$DW$T$36      .dwtag  DW_TAG_typedef
    1300                      .dwattr $C$DW$T$36, DW_AT_name("PI_DATA")
    1301                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    1302                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1303              
    1304              
    1305              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1306                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x28)
    1307              $C$DW$127       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$34)
    1309                      .dwattr $C$DW$127, DW_AT_name("term")
    1310                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_term")
    1311                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1313              
    1314              $C$DW$128       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$35)
    1316                      .dwattr $C$DW$128, DW_AT_name("param")
    1317                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_param")
    1318                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1319                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1320              
    1321              $C$DW$129       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$36)
    1323                      .dwattr $C$DW$129, DW_AT_name("data")
    1324                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_data")
    1325                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1326                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1327              
    1328                      .dwendtag $C$DW$T$37
    1329              
    1330              $C$DW$T$80      .dwtag  DW_TAG_typedef
    1331                      .dwattr $C$DW$T$80, DW_AT_name("PI_SPEED_CONTROLLER")
    1332                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$37)
    1333                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1334              
    1335              
    1336              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1337                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x12)
    1338              $C$DW$130       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$130, DW_AT_name("Ualpha")
    1341                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Ualpha")
    1342                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345              $C$DW$131       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$131, DW_AT_name("Ubeta")
    1348                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_Ubeta")
    1349                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1350                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1351              
    1352              $C$DW$132       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   26

    1354                      .dwattr $C$DW$132, DW_AT_name("Ta")
    1355                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_Ta")
    1356                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1357                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1358              
    1359              $C$DW$133       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$133, DW_AT_name("Tb")
    1362                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_Tb")
    1363                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1364                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366              $C$DW$134       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$134, DW_AT_name("Tc")
    1369                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_Tc")
    1370                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1371                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1372              
    1373              $C$DW$135       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1375                      .dwattr $C$DW$135, DW_AT_name("tmp1")
    1376                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_tmp1")
    1377                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1378                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1379              
    1380              $C$DW$136       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1382                      .dwattr $C$DW$136, DW_AT_name("tmp2")
    1383                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_tmp2")
    1384                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1385                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1386              
    1387              $C$DW$137       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1389                      .dwattr $C$DW$137, DW_AT_name("tmp3")
    1390                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_tmp3")
    1391                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1392                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$138       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$38)
    1396                      .dwattr $C$DW$138, DW_AT_name("VecSector")
    1397                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_VecSector")
    1398                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1399                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401                      .dwendtag $C$DW$T$39
    1402              
    1403              $C$DW$T$81      .dwtag  DW_TAG_typedef
    1404                      .dwattr $C$DW$T$81, DW_AT_name("SVGEN")
    1405                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$39)
    1406                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1407              
    1408              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   27

    1409              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1410                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    1411              $C$DW$139       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$139, DW_AT_name("TargetValue")
    1414                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_TargetValue")
    1415                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1417              
    1418              $C$DW$140       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$40)
    1420                      .dwattr $C$DW$140, DW_AT_name("RampDelayMax")
    1421                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RampDelayMax")
    1422                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1423                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1424              
    1425              $C$DW$141       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$141, DW_AT_name("RampLowLimit")
    1428                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_RampLowLimit")
    1429                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1430                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$142       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$142, DW_AT_name("RampHighLimit")
    1435                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_RampHighLimit")
    1436                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1437                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$143       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$40)
    1441                      .dwattr $C$DW$143, DW_AT_name("RampDelayCount")
    1442                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_RampDelayCount")
    1443                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1444                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1445              
    1446              $C$DW$144       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1448                      .dwattr $C$DW$144, DW_AT_name("SetpointValue")
    1449                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_SetpointValue")
    1450                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1451                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453              $C$DW$145       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$40)
    1455                      .dwattr $C$DW$145, DW_AT_name("EqualFlag")
    1456                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_EqualFlag")
    1457                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1458                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460              $C$DW$146       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$146, DW_AT_name("Tmp")
    1463                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_Tmp")
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   28

    1464                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1465                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1466              
    1467                      .dwendtag $C$DW$T$41
    1468              
    1469              $C$DW$T$82      .dwtag  DW_TAG_typedef
    1470                      .dwattr $C$DW$T$82, DW_AT_name("RMPCNTL")
    1471                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$41)
    1472                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1473              
    1474              
    1475              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1476                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    1477              $C$DW$147       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$147, DW_AT_name("Freq")
    1480                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_Freq")
    1481                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$148       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$148, DW_AT_name("StepAngleMax")
    1487                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_StepAngleMax")
    1488                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1489                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$149       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$149, DW_AT_name("Angle")
    1494                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Angle")
    1495                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1496                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1497              
    1498              $C$DW$150       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$150, DW_AT_name("Gain")
    1501                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Gain")
    1502                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1503                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1504              
    1505              $C$DW$151       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$151, DW_AT_name("Out")
    1508                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Out")
    1509                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1510                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1511              
    1512              $C$DW$152       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$152, DW_AT_name("Offset")
    1515                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Offset")
    1516                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1517                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1518              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   29

    1519                      .dwendtag $C$DW$T$42
    1520              
    1521              $C$DW$T$83      .dwtag  DW_TAG_typedef
    1522                      .dwattr $C$DW$T$83, DW_AT_name("RAMPGEN")
    1523                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    1524                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1525              
    1526              
    1527              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1528                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x16)
    1529              $C$DW$153       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$153, DW_AT_name("DcBusVolt")
    1532                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DcBusVolt")
    1533                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536              $C$DW$154       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$154, DW_AT_name("MfuncV1")
    1539                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_MfuncV1")
    1540                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1541                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1542              
    1543              $C$DW$155       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$155, DW_AT_name("MfuncV2")
    1546                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_MfuncV2")
    1547                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1548                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1549              
    1550              $C$DW$156       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$156, DW_AT_name("MfuncV3")
    1553                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_MfuncV3")
    1554                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1555                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557              $C$DW$157       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$38)
    1559                      .dwattr $C$DW$157, DW_AT_name("OutOfPhase")
    1560                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_OutOfPhase")
    1561                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1562                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$158       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$158, DW_AT_name("VphaseA")
    1567                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_VphaseA")
    1568                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1569                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571              $C$DW$159       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$159, DW_AT_name("VphaseB")
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   30

    1574                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_VphaseB")
    1575                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1576                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1577              
    1578              $C$DW$160       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$160, DW_AT_name("VphaseC")
    1581                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_VphaseC")
    1582                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1583                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1584              
    1585              $C$DW$161       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1587                      .dwattr $C$DW$161, DW_AT_name("Valpha")
    1588                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_Valpha")
    1589                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1590                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1591              
    1592              $C$DW$162       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$162, DW_AT_name("Vbeta")
    1595                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_Vbeta")
    1596                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1597                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1598              
    1599              $C$DW$163       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1601                      .dwattr $C$DW$163, DW_AT_name("temp")
    1602                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_temp")
    1603                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1604                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606                      .dwendtag $C$DW$T$43
    1607              
    1608              $C$DW$T$84      .dwtag  DW_TAG_typedef
    1609                      .dwattr $C$DW$T$84, DW_AT_name("PHASEVOLTAGE")
    1610                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$43)
    1611                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1612              
    1613              
    1614              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1615                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x0e)
    1616              $C$DW$164       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$44)
    1618                      .dwattr $C$DW$164, DW_AT_name("Rs")
    1619                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_Rs")
    1620                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623              $C$DW$165       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$44)
    1625                      .dwattr $C$DW$165, DW_AT_name("Ls")
    1626                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_Ls")
    1627                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1628                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   31

    1629              
    1630              $C$DW$166       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$44)
    1632                      .dwattr $C$DW$166, DW_AT_name("Ib")
    1633                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Ib")
    1634                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1635                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$167       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$44)
    1639                      .dwattr $C$DW$167, DW_AT_name("Vb")
    1640                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Vb")
    1641                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1642                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$168       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$44)
    1646                      .dwattr $C$DW$168, DW_AT_name("Ts")
    1647                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Ts")
    1648                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1649                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1650              
    1651              $C$DW$169       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$44)
    1653                      .dwattr $C$DW$169, DW_AT_name("Fsmopos")
    1654                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Fsmopos")
    1655                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1656                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$170       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$44)
    1660                      .dwattr $C$DW$170, DW_AT_name("Gsmopos")
    1661                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_Gsmopos")
    1662                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1663                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665                      .dwendtag $C$DW$T$45
    1666              
    1667              $C$DW$T$85      .dwtag  DW_TAG_typedef
    1668                      .dwattr $C$DW$T$85, DW_AT_name("SMOPOS_CONST")
    1669                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$45)
    1670                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1671              
    1672              
    1673              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1674                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x24)
    1675              $C$DW$171       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1677                      .dwattr $C$DW$171, DW_AT_name("Valpha")
    1678                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_Valpha")
    1679                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1681              
    1682              $C$DW$172       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   32

    1684                      .dwattr $C$DW$172, DW_AT_name("Ealpha")
    1685                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Ealpha")
    1686                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1687                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$173       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$173, DW_AT_name("Zalpha")
    1692                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_Zalpha")
    1693                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1694                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1695              
    1696              $C$DW$174       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$174, DW_AT_name("Gsmopos")
    1699                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_Gsmopos")
    1700                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1701                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1702              
    1703              $C$DW$175       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$175, DW_AT_name("EstIalpha")
    1706                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_EstIalpha")
    1707                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1708                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1709              
    1710              $C$DW$176       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$176, DW_AT_name("Fsmopos")
    1713                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Fsmopos")
    1714                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1715                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1716              
    1717              $C$DW$177       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$177, DW_AT_name("Vbeta")
    1720                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Vbeta")
    1721                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1722                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724              $C$DW$178       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$178, DW_AT_name("Ebeta")
    1727                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Ebeta")
    1728                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1729                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1730              
    1731              $C$DW$179       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$179, DW_AT_name("Zbeta")
    1734                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Zbeta")
    1735                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1736                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1737              
    1738              $C$DW$180       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   33

    1739                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1740                      .dwattr $C$DW$180, DW_AT_name("EstIbeta")
    1741                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_EstIbeta")
    1742                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1743                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1744              
    1745              $C$DW$181       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1747                      .dwattr $C$DW$181, DW_AT_name("Ialpha")
    1748                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Ialpha")
    1749                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1750                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$182       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$182, DW_AT_name("IalphaError")
    1755                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_IalphaError")
    1756                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1757                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1758              
    1759              $C$DW$183       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$183, DW_AT_name("Kslide")
    1762                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Kslide")
    1763                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1764                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1765              
    1766              $C$DW$184       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$184, DW_AT_name("Ibeta")
    1769                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_Ibeta")
    1770                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1771                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1772              
    1773              $C$DW$185       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1775                      .dwattr $C$DW$185, DW_AT_name("IbetaError")
    1776                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_IbetaError")
    1777                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1778                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1779              
    1780              $C$DW$186       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$186, DW_AT_name("Kslf")
    1783                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_Kslf")
    1784                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1785                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$187       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$187, DW_AT_name("Theta")
    1790                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_Theta")
    1791                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1792                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1793              
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   34

    1794              $C$DW$188       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$188, DW_AT_name("E0")
    1797                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_E0")
    1798                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1799                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1800              
    1801                      .dwendtag $C$DW$T$46
    1802              
    1803              $C$DW$T$86      .dwtag  DW_TAG_typedef
    1804                      .dwattr $C$DW$T$86, DW_AT_name("SMOPOS")
    1805                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$46)
    1806                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1807              
    1808              
    1809              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1810                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x12)
    1811              $C$DW$189       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1813                      .dwattr $C$DW$189, DW_AT_name("EstimatedTheta")
    1814                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_EstimatedTheta")
    1815                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1817              
    1818              $C$DW$190       .dwtag  DW_TAG_member
    1819                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1820                      .dwattr $C$DW$190, DW_AT_name("OldEstimatedTheta")
    1821                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_OldEstimatedTheta")
    1822                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1823                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1824              
    1825              $C$DW$191       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1827                      .dwattr $C$DW$191, DW_AT_name("EstimatedSpeed")
    1828                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_EstimatedSpeed")
    1829                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1830                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$192       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$40)
    1834                      .dwattr $C$DW$192, DW_AT_name("BaseRpm")
    1835                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_BaseRpm")
    1836                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1837                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1838              
    1839              $C$DW$193       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$47)
    1841                      .dwattr $C$DW$193, DW_AT_name("K1")
    1842                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_K1")
    1843                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1844                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1845              
    1846              $C$DW$194       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1848                      .dwattr $C$DW$194, DW_AT_name("K2")
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   35

    1849                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_K2")
    1850                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1851                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1852              
    1853              $C$DW$195       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1855                      .dwattr $C$DW$195, DW_AT_name("K3")
    1856                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_K3")
    1857                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1858                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$196       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$48)
    1862                      .dwattr $C$DW$196, DW_AT_name("EstimatedSpeedRpm")
    1863                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_EstimatedSpeedRpm")
    1864                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1865                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1866              
    1867              $C$DW$197       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$197, DW_AT_name("Temp")
    1870                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Temp")
    1871                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1872                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1873              
    1874                      .dwendtag $C$DW$T$49
    1875              
    1876              $C$DW$T$87      .dwtag  DW_TAG_typedef
    1877                      .dwattr $C$DW$T$87, DW_AT_name("SPEED_ESTIMATION")
    1878                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$49)
    1879                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1880              
    1881              
    1882              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1883                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x14)
    1884              $C$DW$198       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$198, DW_AT_name("ElecTheta")
    1887                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_ElecTheta")
    1888                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1889                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1890              
    1891              $C$DW$199       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    1893                      .dwattr $C$DW$199, DW_AT_name("DirectionQep")
    1894                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DirectionQep")
    1895                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1896                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1897              
    1898              $C$DW$200       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1900                      .dwattr $C$DW$200, DW_AT_name("OldElecTheta")
    1901                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_OldElecTheta")
    1902                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1903                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   36

    1904              
    1905              $C$DW$201       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$201, DW_AT_name("Speed")
    1908                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Speed")
    1909                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1910                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1911              
    1912              $C$DW$202       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$40)
    1914                      .dwattr $C$DW$202, DW_AT_name("BaseRpm")
    1915                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_BaseRpm")
    1916                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1917                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1918              
    1919              $C$DW$203       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$47)
    1921                      .dwattr $C$DW$203, DW_AT_name("K1")
    1922                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_K1")
    1923                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1924                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1925              
    1926              $C$DW$204       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1928                      .dwattr $C$DW$204, DW_AT_name("K2")
    1929                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_K2")
    1930                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1931                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1932              
    1933              $C$DW$205       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1935                      .dwattr $C$DW$205, DW_AT_name("K3")
    1936                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_K3")
    1937                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1938                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940              $C$DW$206       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$48)
    1942                      .dwattr $C$DW$206, DW_AT_name("SpeedRpm")
    1943                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_SpeedRpm")
    1944                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1945                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947              $C$DW$207       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    1949                      .dwattr $C$DW$207, DW_AT_name("Tmp")
    1950                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Tmp")
    1951                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1952                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1953              
    1954                      .dwendtag $C$DW$T$50
    1955              
    1956              $C$DW$T$88      .dwtag  DW_TAG_typedef
    1957                      .dwattr $C$DW$T$88, DW_AT_name("SPEED_MEAS_QEP")
    1958                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v20.2.5 Fri Jan  6 17:23:28 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   37

    1959                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1960              
    1961              
    1962              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1963                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x12)
    1964              $C$DW$208       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$44)
    1966                      .dwattr $C$DW$208, DW_AT_name("ElecTheta")
    1967                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_ElecTheta")
    1968                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1970              
    1971              $C$DW$209       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$44)
    1973                      .dwattr $C$DW$209, DW_AT_name("MechTheta")
    1974                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_MechTheta")
    1975                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1976                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1977              
    1978              $C$DW$210       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$38)
    1980                      .dwattr $C$DW$210, DW_AT_name("DirectionQep")
    1981                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_DirectionQep")
