TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.5.LTS *
       3              ;* Date/Time created: Thu Feb  2 16:59:42 2023                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD_SysCtrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.5.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\jason\workspace_v10_4\MonoMtrServo_379D\F2837x_RAM")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

    2354                      .dwcfi  save_reg_to_mem, 26, 0
    2355 00000355 7622   EALLOW
    2356                      .dwpsn  file "../F2837xD_SysCtrl.c",line 879,column 5,is_stmt,isa 0
    2357 00000356 0200          MOVB      ACC,#0                ; [CPU_ALU] |879| 
    2358 00000357 761F!         MOVW      DP,#_DcsmZ1Regs+16    ; [CPU_ARAU] 
         00000358 0000 
    2359 00000359 1901          SUBB      ACC,#1                ; [CPU_ALU] |879| 
    2360 0000035a 1E10!         MOVL      @$BLOCKED(_DcsmZ1Regs)+16,ACC ; [CPU_ALU] |879| 
    2361                      .dwpsn  file "../F2837xD_SysCtrl.c",line 880,column 5,is_stmt,isa 0
    2362 0000035b 0200          MOVB      ACC,#0                ; [CPU_ALU] |880| 
    2363 0000035c 1901          SUBB      ACC,#1                ; [CPU_ALU] |880| 
    2364 0000035d 1E12!         MOVL      @$BLOCKED(_DcsmZ1Regs)+18,ACC ; [CPU_ALU] |880| 
    2365                      .dwpsn  file "../F2837xD_SysCtrl.c",line 881,column 5,is_stmt,isa 0
    2366 0000035e 0200          MOVB      ACC,#0                ; [CPU_ALU] |881| 
    2367 0000035f 1901          SUBB      ACC,#1                ; [CPU_ALU] |881| 
    2368 00000360 1E14!         MOVL      @$BLOCKED(_DcsmZ1Regs)+20,ACC ; [CPU_ALU] |881| 
    2369                      .dwpsn  file "../F2837xD_SysCtrl.c",line 882,column 5,is_stmt,isa 0
    2370 00000361 0200          MOVB      ACC,#0                ; [CPU_ALU] |882| 
    2371 00000362 1901          SUBB      ACC,#1                ; [CPU_ALU] |882| 
    2372 00000363 1E16!         MOVL      @$BLOCKED(_DcsmZ1Regs)+22,ACC ; [CPU_ALU] |882| 
    2373                      .dwpsn  file "../F2837xD_SysCtrl.c",line 884,column 5,is_stmt,isa 0
    2374 00000364 0200          MOVB      ACC,#0                ; [CPU_ALU] |884| 
    2375 00000365 761F!         MOVW      DP,#_DcsmZ2Regs+16    ; [CPU_ARAU] 
         00000366 0000 
    2376 00000367 1901          SUBB      ACC,#1                ; [CPU_ALU] |884| 
    2377 00000368 1E10!         MOVL      @$BLOCKED(_DcsmZ2Regs)+16,ACC ; [CPU_ALU] |884| 
    2378                      .dwpsn  file "../F2837xD_SysCtrl.c",line 885,column 5,is_stmt,isa 0
    2379 00000369 0200          MOVB      ACC,#0                ; [CPU_ALU] |885| 
    2380 0000036a 1901          SUBB      ACC,#1                ; [CPU_ALU] |885| 
    2381 0000036b 1E12!         MOVL      @$BLOCKED(_DcsmZ2Regs)+18,ACC ; [CPU_ALU] |885| 
    2382                      .dwpsn  file "../F2837xD_SysCtrl.c",line 886,column 5,is_stmt,isa 0
    2383 0000036c 0200          MOVB      ACC,#0                ; [CPU_ALU] |886| 
    2384 0000036d 1901          SUBB      ACC,#1                ; [CPU_ALU] |886| 
    2385 0000036e 1E14!         MOVL      @$BLOCKED(_DcsmZ2Regs)+20,ACC ; [CPU_ALU] |886| 
    2386                      .dwpsn  file "../F2837xD_SysCtrl.c",line 887,column 5,is_stmt,isa 0
    2387 0000036f 0200          MOVB      ACC,#0                ; [CPU_ALU] |887| 
    2388 00000370 1901          SUBB      ACC,#1                ; [CPU_ALU] |887| 
    2389 00000371 1E16!         MOVL      @$BLOCKED(_DcsmZ2Regs)+22,ACC ; [CPU_ALU] |887| 
    2390 00000372 761A   EDIS
    2391 00000373 FF69          SPM       #0                    ; [CPU_ALU] 
    2392                      .dwpsn  file "../F2837xD_SysCtrl.c",line 890,column 5,is_stmt,isa 0
    2393 00000374 9A00          MOVB      AL,#0                 ; [CPU_ALU] |890| 
    2394              $C$DW$99        .dwtag  DW_TAG_TI_branch
    2395                      .dwattr $C$DW$99, DW_AT_low_pc(0x00)
    2396                      .dwattr $C$DW$99, DW_AT_TI_return
    2397              
    2398 00000375 0006          LRETR     ; [CPU_ALU] 
    2399                      ; return occurs ; [] 
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2400                      .dwattr $C$DW$98, DW_AT_TI_end_file("../F2837xD_SysCtrl.c")
    2401                      .dwattr $C$DW$98, DW_AT_TI_end_line(0x37b)
    2402                      .dwattr $C$DW$98, DW_AT_TI_end_column(0x01)
    2403                      .dwendentry
    2404                      .dwendtag $C$DW$98
    2405              
    2406              ;**************************************************************
    2407              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2408              ;**************************************************************
    2409                      .global _GPIO_EnableUnbondedIOPullups
    2410                      .global _FlashPumpSemaphoreRegs
    2411                      .global _CpuTimer2Regs
    2412                      .global _DcsmZ1Regs
    2413                      .global _DcsmZ2Regs
    2414                      .global _Flash0EccRegs
    2415                      .global _WdRegs
    2416                      .global _ClkCfgRegs
    2417                      .global _AnalogSubsysRegs
    2418                      .global _CpuSysRegs
    2419                      .global _DevCfgRegs
    2420                      .global _Flash0CtrlRegs
    2421              
    2422              ;***************************************************************
    2423              ;* TYPE INFORMATION                                            *
    2424              ;***************************************************************
    2425              
    2426              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2427                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2428                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2429              $C$DW$100       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2431                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    2432                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    2433                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$101       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$186)
    2438                      .dwattr $C$DW$101, DW_AT_name("INTOSC1TRIM")
    2439                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2440                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2441                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$102       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$188)
    2445                      .dwattr $C$DW$102, DW_AT_name("INTOSC2TRIM")
    2446                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2447                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2448                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$103       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    2452                      .dwattr $C$DW$103, DW_AT_name("rsvd2")
    2453                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd2")
    2454                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2455                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457              $C$DW$104       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$300)
    2459                      .dwattr $C$DW$104, DW_AT_name("TSNSCTL")
    2460                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_TSNSCTL")
    2461                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2462                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464              $C$DW$105       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
    2466                      .dwattr $C$DW$105, DW_AT_name("rsvd3")
    2467                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd3")
    2468                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2469                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471              $C$DW$106       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$192)
    2473                      .dwattr $C$DW$106, DW_AT_name("LOCK")
    2474                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_LOCK")
    2475                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2476                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2477              
    2478              $C$DW$107       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$23)
    2480                      .dwattr $C$DW$107, DW_AT_name("rsvd4")
    2481                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd4")
    2482                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2483                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2484              
    2485              $C$DW$108       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    2487                      .dwattr $C$DW$108, DW_AT_name("ANAREFTRIMA")
    2488                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2489                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2490                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$109       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$30)
    2494                      .dwattr $C$DW$109, DW_AT_name("ANAREFTRIMB")
    2495                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2496                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2497                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2498              
    2499              $C$DW$110       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$32)
    2501                      .dwattr $C$DW$110, DW_AT_name("ANAREFTRIMC")
    2502                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2503                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2504                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2505              
    2506              $C$DW$111       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$34)
    2508                      .dwattr $C$DW$111, DW_AT_name("ANAREFTRIMD")
    2509                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ANAREFTRIMD")
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2510                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2511                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2512              
    2513              $C$DW$112       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$24)
    2515                      .dwattr $C$DW$112, DW_AT_name("rsvd5")
    2516                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd5")
    2517                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2518                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2519              
    2520                      .dwendtag $C$DW$T$25
    2521              
    2522              $C$DW$113       .dwtag  DW_TAG_TI_far_type
    2523                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$25)
    2524              
    2525              $C$DW$T$348     .dwtag  DW_TAG_volatile_type
    2526                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$113)
    2527              
    2528              
    2529              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2530                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2531                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2532              $C$DW$114       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2534                      .dwattr $C$DW$114, DW_AT_name("BGVALTRIM")
    2535                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_BGVALTRIM")
    2536                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a)
    2537                      .dwattr $C$DW$114, DW_AT_bit_size(0x06)
    2538                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2539                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2540              
    2541              $C$DW$115       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2543                      .dwattr $C$DW$115, DW_AT_name("BGSLOPETRIM")
    2544                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2545                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05)
    2546                      .dwattr $C$DW$115, DW_AT_bit_size(0x05)
    2547                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2549              
    2550              $C$DW$116       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2552                      .dwattr $C$DW$116, DW_AT_name("IREFTRIM")
    2553                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_IREFTRIM")
    2554                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00)
    2555                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    2556                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2558              
    2559              $C$DW$117       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2561                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    2562                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    2563                      .dwattr $C$DW$117, DW_AT_bit_offset(0x08)
    2564                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2565                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2566                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2567              
    2568              $C$DW$118       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2570                      .dwattr $C$DW$118, DW_AT_name("rsvd2")
    2571                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd2")
    2572                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2573                      .dwattr $C$DW$118, DW_AT_bit_size(0x08)
    2574                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2575                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2576              
    2577                      .dwendtag $C$DW$T$26
    2578              
    2579              
    2580              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2581                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2582                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2583              $C$DW$119       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$27)
    2585                      .dwattr $C$DW$119, DW_AT_name("all")
    2586                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    2587                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2588                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2589              
    2590              $C$DW$120       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$26)
    2592                      .dwattr $C$DW$120, DW_AT_name("bit")
    2593                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    2594                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2595                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2596              
    2597                      .dwendtag $C$DW$T$28
    2598              
    2599              
    2600              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2601                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2602                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2603              $C$DW$121       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2605                      .dwattr $C$DW$121, DW_AT_name("BGVALTRIM")
    2606                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_BGVALTRIM")
    2607                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a)
    2608                      .dwattr $C$DW$121, DW_AT_bit_size(0x06)
    2609                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2610                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2611              
    2612              $C$DW$122       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2614                      .dwattr $C$DW$122, DW_AT_name("BGSLOPETRIM")
    2615                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2616                      .dwattr $C$DW$122, DW_AT_bit_offset(0x05)
    2617                      .dwattr $C$DW$122, DW_AT_bit_size(0x05)
    2618                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2620              
    2621              $C$DW$123       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2623                      .dwattr $C$DW$123, DW_AT_name("IREFTRIM")
    2624                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IREFTRIM")
    2625                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2626                      .dwattr $C$DW$123, DW_AT_bit_size(0x05)
    2627                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2628                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2629              
    2630              $C$DW$124       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2632                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    2633                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    2634                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08)
    2635                      .dwattr $C$DW$124, DW_AT_bit_size(0x08)
    2636                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2637                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2638              
    2639              $C$DW$125       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2641                      .dwattr $C$DW$125, DW_AT_name("rsvd2")
    2642                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd2")
    2643                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00)
    2644                      .dwattr $C$DW$125, DW_AT_bit_size(0x08)
    2645                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2646                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2647              
    2648                      .dwendtag $C$DW$T$29
    2649              
    2650              
    2651              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2652                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2653                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2654              $C$DW$126       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
    2656                      .dwattr $C$DW$126, DW_AT_name("all")
    2657                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    2658                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2660              
    2661              $C$DW$127       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
    2663                      .dwattr $C$DW$127, DW_AT_name("bit")
    2664                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    2665                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668                      .dwendtag $C$DW$T$30
    2669              
    2670              
    2671              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2672                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2673                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2674              $C$DW$128       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2675                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2676                      .dwattr $C$DW$128, DW_AT_name("BGVALTRIM")
    2677                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_BGVALTRIM")
    2678                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a)
    2679                      .dwattr $C$DW$128, DW_AT_bit_size(0x06)
    2680                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2682              
    2683              $C$DW$129       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2685                      .dwattr $C$DW$129, DW_AT_name("BGSLOPETRIM")
    2686                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2687                      .dwattr $C$DW$129, DW_AT_bit_offset(0x05)
    2688                      .dwattr $C$DW$129, DW_AT_bit_size(0x05)
    2689                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2691              
    2692              $C$DW$130       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2694                      .dwattr $C$DW$130, DW_AT_name("IREFTRIM")
    2695                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IREFTRIM")
    2696                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2697                      .dwattr $C$DW$130, DW_AT_bit_size(0x05)
    2698                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2700              
    2701              $C$DW$131       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2703                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    2704                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    2705                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    2706                      .dwattr $C$DW$131, DW_AT_bit_size(0x08)
    2707                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2708                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2709              
    2710              $C$DW$132       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2712                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    2713                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    2714                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2715                      .dwattr $C$DW$132, DW_AT_bit_size(0x08)
    2716                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2717                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2718              
    2719                      .dwendtag $C$DW$T$31
    2720              
    2721              
    2722              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2723                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2724                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2725              $C$DW$133       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$27)
    2727                      .dwattr $C$DW$133, DW_AT_name("all")
    2728                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    2729                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2730                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2731              
    2732              $C$DW$134       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    2734                      .dwattr $C$DW$134, DW_AT_name("bit")
    2735                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    2736                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739                      .dwendtag $C$DW$T$32
    2740              
    2741              
    2742              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2743                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2744                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2745              $C$DW$135       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2747                      .dwattr $C$DW$135, DW_AT_name("BGVALTRIM")
    2748                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_BGVALTRIM")
    2749                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0a)
    2750                      .dwattr $C$DW$135, DW_AT_bit_size(0x06)
    2751                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2752                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2753              
    2754              $C$DW$136       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2756                      .dwattr $C$DW$136, DW_AT_name("BGSLOPETRIM")
    2757                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2758                      .dwattr $C$DW$136, DW_AT_bit_offset(0x05)
    2759                      .dwattr $C$DW$136, DW_AT_bit_size(0x05)
    2760                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2762              
    2763              $C$DW$137       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2765                      .dwattr $C$DW$137, DW_AT_name("IREFTRIM")
    2766                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IREFTRIM")
    2767                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2768                      .dwattr $C$DW$137, DW_AT_bit_size(0x05)
    2769                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2770                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2771              
    2772              $C$DW$138       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2774                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    2775                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    2776                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    2777                      .dwattr $C$DW$138, DW_AT_bit_size(0x08)
    2778                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2779                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2780              
    2781              $C$DW$139       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2783                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    2784                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2785                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2786                      .dwattr $C$DW$139, DW_AT_bit_size(0x08)
    2787                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2788                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2789              
    2790                      .dwendtag $C$DW$T$33
    2791              
    2792              
    2793              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2794                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2795                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2796              $C$DW$140       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2798                      .dwattr $C$DW$140, DW_AT_name("all")
    2799                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    2800                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2801                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2802              
    2803              $C$DW$141       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$33)
    2805                      .dwattr $C$DW$141, DW_AT_name("bit")
    2806                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    2807                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810                      .dwendtag $C$DW$T$34
    2811              
    2812              
    2813              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2814                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2815                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2816              $C$DW$142       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2818                      .dwattr $C$DW$142, DW_AT_name("AUXPLLDIV")
    2819                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2820                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e)
    2821                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    2822                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2823                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2824              
    2825              $C$DW$143       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2827                      .dwattr $C$DW$143, DW_AT_name("rsvd1")
    2828                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd1")
    2829                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2830                      .dwattr $C$DW$143, DW_AT_bit_size(0x0e)
    2831                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2832                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2833              
    2834              $C$DW$144       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2836                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    2837                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    2838                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00)
    2839                      .dwattr $C$DW$144, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2840                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2841                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2842              
    2843                      .dwendtag $C$DW$T$35
    2844              
    2845              
    2846              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2847                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2848                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2849              $C$DW$145       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$27)
    2851                      .dwattr $C$DW$145, DW_AT_name("all")
    2852                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    2853                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2854                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2855              
    2856              $C$DW$146       .dwtag  DW_TAG_member
    2857                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$35)
    2858                      .dwattr $C$DW$146, DW_AT_name("bit")
    2859                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    2860                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2861                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2862              
    2863                      .dwendtag $C$DW$T$36
    2864              
    2865              
    2866              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2867                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2868                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2869              $C$DW$147       .dwtag  DW_TAG_member
    2870                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2871                      .dwattr $C$DW$147, DW_AT_name("PLLEN")
    2872                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PLLEN")
    2873                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0f)
    2874                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2875                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2877              
    2878              $C$DW$148       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2880                      .dwattr $C$DW$148, DW_AT_name("PLLCLKEN")
    2881                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PLLCLKEN")
    2882                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e)
    2883                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2884                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2885                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2886              
    2887              $C$DW$149       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2889                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    2890                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    2891                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    2892                      .dwattr $C$DW$149, DW_AT_bit_size(0x0e)
    2893                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2895              
    2896              $C$DW$150       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2898                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    2899                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    2900                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    2901                      .dwattr $C$DW$150, DW_AT_bit_size(0x10)
    2902                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2903                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2904              
    2905                      .dwendtag $C$DW$T$37
    2906              
    2907              
    2908              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2909                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2910                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2911              $C$DW$151       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
    2913                      .dwattr $C$DW$151, DW_AT_name("all")
    2914                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    2915                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2916                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2917              
    2918              $C$DW$152       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$37)
    2920                      .dwattr $C$DW$152, DW_AT_name("bit")
    2921                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    2922                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2923                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2924              
    2925                      .dwendtag $C$DW$T$38
    2926              
    2927              
    2928              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2929                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2930                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2931              $C$DW$153       .dwtag  DW_TAG_member
    2932                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2933                      .dwattr $C$DW$153, DW_AT_name("IMULT")
    2934                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_IMULT")
    2935                      .dwattr $C$DW$153, DW_AT_bit_offset(0x09)
    2936                      .dwattr $C$DW$153, DW_AT_bit_size(0x07)
    2937                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2938                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2939              
    2940              $C$DW$154       .dwtag  DW_TAG_member
    2941                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2942                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    2943                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
    2944                      .dwattr $C$DW$154, DW_AT_bit_offset(0x08)
    2945                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2946                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2947                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2948              
    2949              $C$DW$155       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    2950                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2951                      .dwattr $C$DW$155, DW_AT_name("FMULT")
    2952                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_FMULT")
    2953                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    2954                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2955                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2956                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2957              
    2958              $C$DW$156       .dwtag  DW_TAG_member
    2959                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2960                      .dwattr $C$DW$156, DW_AT_name("rsvd2")
    2961                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd2")
    2962                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2963                      .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2964                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2965                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2966              
    2967              $C$DW$157       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2969                      .dwattr $C$DW$157, DW_AT_name("rsvd3")
    2970                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd3")
    2971                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    2972                      .dwattr $C$DW$157, DW_AT_bit_size(0x10)
    2973                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2974                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2975              
    2976                      .dwendtag $C$DW$T$39
    2977              
    2978              
    2979              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2980                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2981                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2982              $C$DW$158       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$27)
    2984                      .dwattr $C$DW$158, DW_AT_name("all")
    2985                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    2986                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2987                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2988              
    2989              $C$DW$159       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$39)
    2991                      .dwattr $C$DW$159, DW_AT_name("bit")
    2992                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    2993                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2994                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2995              
    2996                      .dwendtag $C$DW$T$40
    2997              
    2998              
    2999              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3000                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    3001                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3002              $C$DW$160       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    3004                      .dwattr $C$DW$160, DW_AT_name("LOCKS")
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3005                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_LOCKS")
    3006                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f)
    3007                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    3008                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3009                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3010              
    3011              $C$DW$161       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    3013                      .dwattr $C$DW$161, DW_AT_name("SLIPS")
    3014                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SLIPS")
    3015                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    3016                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    3017                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3018                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3019              
    3020              $C$DW$162       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    3022                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    3023                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    3024                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    3025                      .dwattr $C$DW$162, DW_AT_bit_size(0x0e)
    3026                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3027                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3028              
    3029              $C$DW$163       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    3031                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    3032                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    3033                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    3034                      .dwattr $C$DW$163, DW_AT_bit_size(0x10)
    3035                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3036                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3037              
    3038                      .dwendtag $C$DW$T$41
    3039              
    3040              
    3041              $C$DW$T$42      .dwtag  DW_TAG_union_type
    3042                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    3043                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3044              $C$DW$164       .dwtag  DW_TAG_member
    3045                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    3046                      .dwattr $C$DW$164, DW_AT_name("all")
    3047                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    3048                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3050              
    3051              $C$DW$165       .dwtag  DW_TAG_member
    3052                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$41)
    3053                      .dwattr $C$DW$165, DW_AT_name("bit")
    3054                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    3055                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3057              
    3058                      .dwendtag $C$DW$T$42
    3059              
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3060              
    3061              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3062                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    3063                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3064              $C$DW$166       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    3066                      .dwattr $C$DW$166, DW_AT_name("CLKSRCCTL1")
    3067                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3068                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f)
    3069                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    3070                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3072              
    3073              $C$DW$167       .dwtag  DW_TAG_member
    3074                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    3075                      .dwattr $C$DW$167, DW_AT_name("CLKSRCCTL2")
    3076                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3077                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e)
    3078                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    3079                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3080                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3081              
    3082              $C$DW$168       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    3084                      .dwattr $C$DW$168, DW_AT_name("CLKSRCCTL3")
    3085                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3086                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d)
    3087                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    3088                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3089                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3090              
    3091              $C$DW$169       .dwtag  DW_TAG_member
    3092                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    3093                      .dwattr $C$DW$169, DW_AT_name("SYSPLLCTL1")
    3094                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3095                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c)
    3096                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    3097                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3098                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3099              
    3100              $C$DW$170       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    3102                      .dwattr $C$DW$170, DW_AT_name("SYSPLLCTL2")
    3103                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    3104                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0b)
    3105                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    3106                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3107                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3108              
    3109              $C$DW$171       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    3111                      .dwattr $C$DW$171, DW_AT_name("SYSPLLCTL3")
    3112                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    3113                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0a)
    3114                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3115                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3116                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3117              
    3118              $C$DW$172       .dwtag  DW_TAG_member
    3119                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    3120                      .dwattr $C$DW$172, DW_AT_name("SYSPLLMULT")
    3121                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3122                      .dwattr $C$DW$172, DW_AT_bit_offset(0x09)
    3123                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    3124                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3126              
    3127              $C$DW$173       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    3129                      .dwattr $C$DW$173, DW_AT_name("AUXPLLCTL1")
    3130                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3131                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08)
    3132                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    3133                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3135              
    3136              $C$DW$174       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    3138                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    3139                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    3140                      .dwattr $C$DW$174, DW_AT_bit_offset(0x07)
    3141                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    3142                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3143                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3144              
    3145              $C$DW$175       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    3147                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    3148                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    3149                      .dwattr $C$DW$175, DW_AT_bit_offset(0x06)
    3150                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    3151                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3152                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3153              
    3154              $C$DW$176       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3156                      .dwattr $C$DW$176, DW_AT_name("AUXPLLMULT")
    3157                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3158                      .dwattr $C$DW$176, DW_AT_bit_offset(0x05)
    3159                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    3160                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163              $C$DW$177       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    3165                      .dwattr $C$DW$177, DW_AT_name("SYSCLKDIVSEL")
    3166                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3167                      .dwattr $C$DW$177, DW_AT_bit_offset(0x04)
    3168                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    3169                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3170                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3171              
    3172              $C$DW$178       .dwtag  DW_TAG_member
    3173                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    3174                      .dwattr $C$DW$178, DW_AT_name("AUXCLKDIVSEL")
    3175                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3176                      .dwattr $C$DW$178, DW_AT_bit_offset(0x03)
    3177                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    3178                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3179                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3180              
    3181              $C$DW$179       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3183                      .dwattr $C$DW$179, DW_AT_name("PERCLKDIVSEL")
    3184                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3185                      .dwattr $C$DW$179, DW_AT_bit_offset(0x02)
    3186                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    3187                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3188                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3189              
    3190              $C$DW$180       .dwtag  DW_TAG_member
    3191                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3192                      .dwattr $C$DW$180, DW_AT_name("rsvd3")
    3193                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd3")
    3194                      .dwattr $C$DW$180, DW_AT_bit_offset(0x01)
    3195                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    3196                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3197                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3198              
    3199              $C$DW$181       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3201                      .dwattr $C$DW$181, DW_AT_name("LOSPCP")
    3202                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LOSPCP")
    3203                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00)
    3204                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    3205                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3206                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3207              
    3208              $C$DW$182       .dwtag  DW_TAG_member
    3209                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3210                      .dwattr $C$DW$182, DW_AT_name("rsvd4")
    3211                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd4")
    3212                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    3213                      .dwattr $C$DW$182, DW_AT_bit_size(0x10)
    3214                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3215                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3216              
    3217                      .dwendtag $C$DW$T$43
    3218              
    3219              
    3220              $C$DW$T$44      .dwtag  DW_TAG_union_type
    3221                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    3222                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3223              $C$DW$183       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3225                      .dwattr $C$DW$183, DW_AT_name("all")
    3226                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    3227                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3228                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3229              
    3230              $C$DW$184       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$43)
    3232                      .dwattr $C$DW$184, DW_AT_name("bit")
    3233                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    3234                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3236              
    3237                      .dwendtag $C$DW$T$44
    3238              
    3239              
    3240              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3241                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    3242                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3243              $C$DW$185       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3245                      .dwattr $C$DW$185, DW_AT_name("SEM")
    3246                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SEM")
    3247                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e)
    3248                      .dwattr $C$DW$185, DW_AT_bit_size(0x02)
    3249                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3250                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$186       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    3254                      .dwattr $C$DW$186, DW_AT_name("rsvd1")
    3255                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd1")
    3256                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00)
    3257                      .dwattr $C$DW$186, DW_AT_bit_size(0x0e)
    3258                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3260              
    3261              $C$DW$187       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3263                      .dwattr $C$DW$187, DW_AT_name("KEY")
    3264                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_KEY")
    3265                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3266                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    3267                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3268                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3269              
    3270                      .dwendtag $C$DW$T$45
    3271              
    3272              
    3273              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3274                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    3275                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3276              $C$DW$188       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$27)
    3278                      .dwattr $C$DW$188, DW_AT_name("all")
    3279                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   65

    3280                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3281                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3282              
    3283              $C$DW$189       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$45)
    3285                      .dwattr $C$DW$189, DW_AT_name("bit")
    3286                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    3287                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3288                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3289              
    3290                      .dwendtag $C$DW$T$46
    3291              
    3292              
    3293              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3294                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    3295                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3296              $C$DW$190       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3298                      .dwattr $C$DW$190, DW_AT_name("OSCCLKSRCSEL")
    3299                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    3300                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    3301                      .dwattr $C$DW$190, DW_AT_bit_size(0x02)
    3302                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3303                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$191       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3307                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
    3308                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
    3309                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d)
    3310                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    3311                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3313              
    3314              $C$DW$192       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3316                      .dwattr $C$DW$192, DW_AT_name("INTOSC2OFF")
    3317                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTOSC2OFF")
    3318                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c)
    3319                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    3320                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3321                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3322              
    3323              $C$DW$193       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3325                      .dwattr $C$DW$193, DW_AT_name("XTALOFF")
    3326                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_XTALOFF")
    3327                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0b)
    3328                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    3329                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3330                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3331              
    3332              $C$DW$194       .dwtag  DW_TAG_member
    3333                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3334                      .dwattr $C$DW$194, DW_AT_name("WDHALTI")
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   66

    3335                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_WDHALTI")
    3336                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0a)
    3337                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    3338                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3340              
    3341              $C$DW$195       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3343                      .dwattr $C$DW$195, DW_AT_name("rsvd2")
    3344                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd2")
    3345                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    3346                      .dwattr $C$DW$195, DW_AT_bit_size(0x0a)
    3347                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3349              
    3350              $C$DW$196       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3352                      .dwattr $C$DW$196, DW_AT_name("rsvd3")
    3353                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd3")
    3354                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    3355                      .dwattr $C$DW$196, DW_AT_bit_size(0x10)
    3356                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3357                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3358              
    3359                      .dwendtag $C$DW$T$47
    3360              
    3361              
    3362              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3363                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    3364                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3365              $C$DW$197       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$27)
    3367                      .dwattr $C$DW$197, DW_AT_name("all")
    3368                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    3369                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3370                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3371              
    3372              $C$DW$198       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$47)
    3374                      .dwattr $C$DW$198, DW_AT_name("bit")
    3375                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    3376                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3377                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3378              
    3379                      .dwendtag $C$DW$T$48
    3380              
    3381              
    3382              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3383                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    3384                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3385              $C$DW$199       .dwtag  DW_TAG_member
    3386                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3387                      .dwattr $C$DW$199, DW_AT_name("AUXOSCCLKSRCSEL")
    3388                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3389                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   67

    3390                      .dwattr $C$DW$199, DW_AT_bit_size(0x02)
    3391                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3392                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3393              
    3394              $C$DW$200       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3396                      .dwattr $C$DW$200, DW_AT_name("CANABCLKSEL")
    3397                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3398                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0c)
    3399                      .dwattr $C$DW$200, DW_AT_bit_size(0x02)
    3400                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3401                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3402              
    3403              $C$DW$201       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3405                      .dwattr $C$DW$201, DW_AT_name("CANBBCLKSEL")
    3406                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3407                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0a)
    3408                      .dwattr $C$DW$201, DW_AT_bit_size(0x02)
    3409                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3410                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3411              
    3412              $C$DW$202       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3414                      .dwattr $C$DW$202, DW_AT_name("rsvd1")
    3415                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd1")
    3416                      .dwattr $C$DW$202, DW_AT_bit_offset(0x08)
    3417                      .dwattr $C$DW$202, DW_AT_bit_size(0x02)
    3418                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3420              
    3421              $C$DW$203       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3423                      .dwattr $C$DW$203, DW_AT_name("rsvd2")
    3424                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd2")
    3425                      .dwattr $C$DW$203, DW_AT_bit_offset(0x06)
    3426                      .dwattr $C$DW$203, DW_AT_bit_size(0x02)
    3427                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3428                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3429              
    3430              $C$DW$204       .dwtag  DW_TAG_member
    3431                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3432                      .dwattr $C$DW$204, DW_AT_name("rsvd3")
    3433                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd3")
    3434                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    3435                      .dwattr $C$DW$204, DW_AT_bit_size(0x06)
    3436                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3437                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3438              
    3439              $C$DW$205       .dwtag  DW_TAG_member
    3440                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3441                      .dwattr $C$DW$205, DW_AT_name("rsvd4")
    3442                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd4")
    3443                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00)
    3444                      .dwattr $C$DW$205, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   68

    3445                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3446                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3447              
    3448                      .dwendtag $C$DW$T$49
    3449              
    3450              
    3451              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3452                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3453                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3454              $C$DW$206       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$27)
    3456                      .dwattr $C$DW$206, DW_AT_name("all")
    3457                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_all")
    3458                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3459                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3460              
    3461              $C$DW$207       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$49)
    3463                      .dwattr $C$DW$207, DW_AT_name("bit")
    3464                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_bit")
    3465                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3466                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3467              
    3468                      .dwendtag $C$DW$T$50
    3469              
    3470              
    3471              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3472                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3473                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3474              $C$DW$208       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3476                      .dwattr $C$DW$208, DW_AT_name("XCLKOUTSEL")
    3477                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3478                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0d)
    3479                      .dwattr $C$DW$208, DW_AT_bit_size(0x03)
    3480                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3481                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3482              
    3483              $C$DW$209       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3485                      .dwattr $C$DW$209, DW_AT_name("rsvd1")
    3486                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd1")
    3487                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00)
    3488                      .dwattr $C$DW$209, DW_AT_bit_size(0x0d)
    3489                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3490                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3491              
    3492              $C$DW$210       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3494                      .dwattr $C$DW$210, DW_AT_name("rsvd2")
    3495                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd2")
    3496                      .dwattr $C$DW$210, DW_AT_bit_offset(0x00)
    3497                      .dwattr $C$DW$210, DW_AT_bit_size(0x10)
    3498                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3499                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   69

    3500              
    3501                      .dwendtag $C$DW$T$51
    3502              
    3503              
    3504              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3505                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3506                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3507              $C$DW$211       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3509                      .dwattr $C$DW$211, DW_AT_name("all")
    3510                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_all")
    3511                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3512                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3513              
    3514              $C$DW$212       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$51)
    3516                      .dwattr $C$DW$212, DW_AT_name("bit")
    3517                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_bit")
    3518                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3519                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3520              
    3521                      .dwendtag $C$DW$T$52
    3522              
    3523              
    3524              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3525                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
    3526                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3527              $C$DW$213       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$46)
    3529                      .dwattr $C$DW$213, DW_AT_name("CLKSEM")
    3530                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CLKSEM")
    3531                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3532                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3533              
    3534              $C$DW$214       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$44)
    3536                      .dwattr $C$DW$214, DW_AT_name("CLKCFGLOCK1")
    3537                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3538                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3539                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3540              
    3541              $C$DW$215       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$53)
    3543                      .dwattr $C$DW$215, DW_AT_name("rsvd1")
    3544                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd1")
    3545                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3546                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3547              
    3548              $C$DW$216       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$48)
    3550                      .dwattr $C$DW$216, DW_AT_name("CLKSRCCTL1")
    3551                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3552                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3553                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3554              
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   70

    3555              $C$DW$217       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$50)
    3557                      .dwattr $C$DW$217, DW_AT_name("CLKSRCCTL2")
    3558                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3559                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3560                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3561              
    3562              $C$DW$218       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$52)
    3564                      .dwattr $C$DW$218, DW_AT_name("CLKSRCCTL3")
    3565                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3566                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3567                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3568              
    3569              $C$DW$219       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$284)
    3571                      .dwattr $C$DW$219, DW_AT_name("SYSPLLCTL1")
    3572                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3573                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3574                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3575              
    3576              $C$DW$220       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$53)
    3578                      .dwattr $C$DW$220, DW_AT_name("rsvd2")
    3579                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd2")
    3580                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3581                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3582              
    3583              $C$DW$221       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$286)
    3585                      .dwattr $C$DW$221, DW_AT_name("SYSPLLMULT")
    3586                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3587                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3588                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3589              
    3590              $C$DW$222       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$288)
    3592                      .dwattr $C$DW$222, DW_AT_name("SYSPLLSTS")
    3593                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3594                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3595                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3596              
    3597              $C$DW$223       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$38)
    3599                      .dwattr $C$DW$223, DW_AT_name("AUXPLLCTL1")
    3600                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3601                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3602                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3603              
    3604              $C$DW$224       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$53)
    3606                      .dwattr $C$DW$224, DW_AT_name("rsvd3")
    3607                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd3")
    3608                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3609                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   71

    3610              
    3611              $C$DW$225       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$40)
    3613                      .dwattr $C$DW$225, DW_AT_name("AUXPLLMULT")
    3614                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3615                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3616                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3617              
    3618              $C$DW$226       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$42)
    3620                      .dwattr $C$DW$226, DW_AT_name("AUXPLLSTS")
    3621                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3622                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3623                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3624              
    3625              $C$DW$227       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$280)
    3627                      .dwattr $C$DW$227, DW_AT_name("SYSCLKDIVSEL")
    3628                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3629                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3630                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3631              
    3632              $C$DW$228       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$36)
    3634                      .dwattr $C$DW$228, DW_AT_name("AUXCLKDIVSEL")
    3635                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3636                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3637                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3638              
    3639              $C$DW$229       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$236)
    3641                      .dwattr $C$DW$229, DW_AT_name("PERCLKDIVSEL")
    3642                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3643                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3644                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3645              
    3646              $C$DW$230       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$315)
    3648                      .dwattr $C$DW$230, DW_AT_name("XCLKOUTDIVSEL")
    3649                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3650                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3651                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3652              
    3653              $C$DW$231       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$21)
    3655                      .dwattr $C$DW$231, DW_AT_name("rsvd4")
    3656                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd4")
    3657                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3658                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3659              
    3660              $C$DW$232       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$194)
    3662                      .dwattr $C$DW$232, DW_AT_name("LOSPCP")
    3663                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_LOSPCP")
    3664                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   72

    3665                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3666              
    3667              $C$DW$233       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$200)
    3669                      .dwattr $C$DW$233, DW_AT_name("MCDCR")
    3670                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_MCDCR")
    3671                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3672                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3673              
    3674              $C$DW$234       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$313)
    3676                      .dwattr $C$DW$234, DW_AT_name("X1CNT")
    3677                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_X1CNT")
    3678                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3679                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3680              
    3681                      .dwendtag $C$DW$T$54
    3682              
    3683              $C$DW$235       .dwtag  DW_TAG_TI_far_type
    3684                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$54)
    3685              
    3686              $C$DW$T$354     .dwtag  DW_TAG_volatile_type
    3687                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$235)
    3688              
    3689              
    3690              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3691                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3692                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3693              $C$DW$236       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3695                      .dwattr $C$DW$236, DW_AT_name("RESET")
    3696                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RESET")
    3697                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0f)
    3698                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    3699                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3700                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3701              
    3702              $C$DW$237       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3704                      .dwattr $C$DW$237, DW_AT_name("rsvd1")
    3705                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd1")
    3706                      .dwattr $C$DW$237, DW_AT_bit_offset(0x00)
    3707                      .dwattr $C$DW$237, DW_AT_bit_size(0x0f)
    3708                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3709                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3710              
    3711              $C$DW$238       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3713                      .dwattr $C$DW$238, DW_AT_name("KEY")
    3714                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_KEY")
    3715                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00)
    3716                      .dwattr $C$DW$238, DW_AT_bit_size(0x10)
    3717                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3718                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3719              
TMS320C2000 Assembler PC v20.2.5 Thu Feb  2 16:59:42 2023

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   73

    3720                      .dwendtag $C$DW$T$55
    3721              
    3722              
    3723              $C$DW$T$56      .dwtag  DW_TAG_union_type
