TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.0.LTS *
       3              ;* Date/Time created: Tue Sep  7 11:06:10 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../F2837xD_Dac.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Motortech\workspace_v10_2\MonoMtrServo_379D\F2837x_RAM")
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     139              $C$DW$11        .dwtag  DW_TAG_formal_parameter
     140                      .dwattr $C$DW$11, DW_AT_name("dac_num")
     141                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_dac_num")
     142                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     143                      .dwattr $C$DW$11, DW_AT_location[DW_OP_reg0]
     144              
     145              
     146              ;***************************************************************
     147              ;* FNAME: _configureDAC                 FR SIZE:   0           *
     148              ;*                                                             *
     149              ;* FUNCTION ENVIRONMENT                                        *
     150              ;*                                                             *
     151              ;* FUNCTION PROPERTIES                                         *
     152              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     153              ;***************************************************************
     154              
     155 00000000       _configureDAC:
     156              ;* AR4   assigned to $O$C1
     157                      .dwcfi  cfa_offset, -2
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    4

     158                      .dwcfi  save_reg_to_mem, 26, 0
     159 00000000 7622   EALLOW
     160 00000001 2901          CLRC      SXM                   ; [CPU_ALU] 
     161                      .dwpsn  file "../F2837xD_Dac.c",line 25,column 5,is_stmt,isa 0
     162 00000002 8F00-         MOVL      XAR4,#_DAC_PTR        ; [CPU_ARAU] |25| 
         00000003 0000 
     163 00000004 5603          MOV       ACC,AL << 1           ; [CPU_ALU] |25| 
         00000005 01A9 
     164 00000006 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |25| 
         00000007 00A4 
     165 00000008 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |25| 
     166                      .dwpsn  file "../F2837xD_Dac.c",line 28,column 5,is_stmt,isa 0
     167 00000009 8F40          MOVL      XAR5,#398             ; [CPU_ARAU] |28| 
         0000000a 018E 
     168 0000000b FF69          SPM       #0                    ; [CPU_ALU] 
     169 0000000c A0A9          MOVL      ACC,XAR5              ; [CPU_ALU] |28| 
     170                      .dwpsn  file "../F2837xD_Dac.c",line 25,column 5,is_stmt,isa 0
     171 0000000d 18CC          AND       *+XAR4[1],#0xfffe     ; [CPU_ALU] |25| 
         0000000e FFFE 
     172                      .dwpsn  file "../F2837xD_Dac.c",line 26,column 5,is_stmt,isa 0
     173 0000000f 1AE4          OR        *+XAR4[4],#0x0001     ; [CPU_ALU] |26| 
         00000010 0001 
     174                      .dwpsn  file "../F2837xD_Dac.c",line 27,column 5,is_stmt,isa 0
     175 00000011 2BDC          MOV       *+XAR4[3],#0          ; [CPU_ALU] |27| 
     176                      .dwpsn  file "../F2837xD_Dac.c",line 28,column 5,is_stmt,isa 0
     177              $C$DW$12        .dwtag  DW_TAG_TI_branch
     178                      .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     179                      .dwattr $C$DW$12, DW_AT_name("_F28x_usDelay")
     180                      .dwattr $C$DW$12, DW_AT_TI_call
     181              
     182 00000012 7640!         LCR       #_F28x_usDelay        ; [CPU_ALU] |28| 
         00000013 0000 
     183                      ; call occurs [#_F28x_usDelay] ; [] |28| 
     184 00000014 761A   EDIS
     185 00000015 FF69          SPM       #0                    ; [CPU_ALU] 
     186              $C$DW$13        .dwtag  DW_TAG_TI_branch
     187                      .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     188                      .dwattr $C$DW$13, DW_AT_TI_return
     189              
     190 00000016 0006          LRETR     ; [CPU_ALU] 
     191                      ; return occurs ; [] 
     192                      .dwattr $C$DW$10, DW_AT_TI_end_file("../F2837xD_Dac.c")
     193                      .dwattr $C$DW$10, DW_AT_TI_end_line(0x1e)
     194                      .dwattr $C$DW$10, DW_AT_TI_end_column(0x01)
     195                      .dwendentry
     196                      .dwendtag $C$DW$10
     197              
     198              ;**************************************************************
     199              ;* UNDEFINED EXTERNAL REFERENCES                              *
     200              ;**************************************************************
     201                      .global _F28x_usDelay
     202                      .global _DacaRegs
     203                      .global _DacbRegs
     204                      .global _DaccRegs
     205              
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    5

     206              ;***************************************************************
     207              ;* TYPE INFORMATION                                            *
     208              ;***************************************************************
     209              
     210              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     211                      .dwattr $C$DW$T$20, DW_AT_name("DACCTL_BITS")
     212                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     213              $C$DW$14        .dwtag  DW_TAG_member
     214                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     215                      .dwattr $C$DW$14, DW_AT_name("DACREFSEL")
     216                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_DACREFSEL")
     217                      .dwattr $C$DW$14, DW_AT_bit_offset(0x0f)
     218                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     219                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     220                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     221              
     222              $C$DW$15        .dwtag  DW_TAG_member
     223                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     224                      .dwattr $C$DW$15, DW_AT_name("rsvd1")
     225                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_rsvd1")
     226                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0e)
     227                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     228                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     229                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     230              
     231              $C$DW$16        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     233                      .dwattr $C$DW$16, DW_AT_name("LOADMODE")
     234                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_LOADMODE")
     235                      .dwattr $C$DW$16, DW_AT_bit_offset(0x0d)
     236                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     237                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     238                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     239              
     240              $C$DW$17        .dwtag  DW_TAG_member
     241                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     242                      .dwattr $C$DW$17, DW_AT_name("rsvd2")
     243                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_rsvd2")
     244                      .dwattr $C$DW$17, DW_AT_bit_offset(0x0c)
     245                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     246                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     247                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     248              
     249              $C$DW$18        .dwtag  DW_TAG_member
     250                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     251                      .dwattr $C$DW$18, DW_AT_name("SYNCSEL")
     252                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_SYNCSEL")
     253                      .dwattr $C$DW$18, DW_AT_bit_offset(0x08)
     254                      .dwattr $C$DW$18, DW_AT_bit_size(0x04)
     255                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     256                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     257              
     258              $C$DW$19        .dwtag  DW_TAG_member
     259                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     260                      .dwattr $C$DW$19, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    6

     261                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd3")
     262                      .dwattr $C$DW$19, DW_AT_bit_offset(0x00)
     263                      .dwattr $C$DW$19, DW_AT_bit_size(0x08)
     264                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     266              
     267                      .dwendtag $C$DW$T$20
     268              
     269              
     270              $C$DW$T$21      .dwtag  DW_TAG_union_type
     271                      .dwattr $C$DW$T$21, DW_AT_name("DACCTL_REG")
     272                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     273              $C$DW$20        .dwtag  DW_TAG_member
     274                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     275                      .dwattr $C$DW$20, DW_AT_name("all")
     276                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_all")
     277                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     278                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     279              
     280              $C$DW$21        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
     282                      .dwattr $C$DW$21, DW_AT_name("bit")
     283                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_bit")
     284                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     285                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     286              
     287                      .dwendtag $C$DW$T$21
     288              
     289              
     290              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     291                      .dwattr $C$DW$T$22, DW_AT_name("DACLOCK_BITS")
     292                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     293              $C$DW$22        .dwtag  DW_TAG_member
     294                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     295                      .dwattr $C$DW$22, DW_AT_name("DACCTL")
     296                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_DACCTL")
     297                      .dwattr $C$DW$22, DW_AT_bit_offset(0x0f)
     298                      .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     299                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     300                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     301              
     302              $C$DW$23        .dwtag  DW_TAG_member
     303                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     304                      .dwattr $C$DW$23, DW_AT_name("DACVAL")
     305                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_DACVAL")
     306                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0e)
     307                      .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     308                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311              $C$DW$24        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     313                      .dwattr $C$DW$24, DW_AT_name("DACOUTEN")
     314                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_DACOUTEN")
     315                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0d)
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    7

     316                      .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     317                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     318                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     319              
     320              $C$DW$25        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     322                      .dwattr $C$DW$25, DW_AT_name("rsvd1")
     323                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_rsvd1")
     324                      .dwattr $C$DW$25, DW_AT_bit_offset(0x00)
     325                      .dwattr $C$DW$25, DW_AT_bit_size(0x0d)
     326                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     327                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     328              
     329                      .dwendtag $C$DW$T$22
     330              
     331              
     332              $C$DW$T$23      .dwtag  DW_TAG_union_type
     333                      .dwattr $C$DW$T$23, DW_AT_name("DACLOCK_REG")
     334                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     335              $C$DW$26        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$26, DW_AT_name("all")
     338                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_all")
     339                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342              $C$DW$27        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$22)
     344                      .dwattr $C$DW$27, DW_AT_name("bit")
     345                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_bit")
     346                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     348              
     349                      .dwendtag $C$DW$T$23
     350              
     351              
     352              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     353                      .dwattr $C$DW$T$24, DW_AT_name("DACOUTEN_BITS")
     354                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     355              $C$DW$28        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$28, DW_AT_name("DACOUTEN")
     358                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_DACOUTEN")
     359                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0f)
     360                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     361                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     363              
     364              $C$DW$29        .dwtag  DW_TAG_member
     365                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     366                      .dwattr $C$DW$29, DW_AT_name("rsvd1")
     367                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_rsvd1")
     368                      .dwattr $C$DW$29, DW_AT_bit_offset(0x00)
     369                      .dwattr $C$DW$29, DW_AT_bit_size(0x0f)
     370                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    8

     371                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     372              
     373                      .dwendtag $C$DW$T$24
     374              
     375              
     376              $C$DW$T$25      .dwtag  DW_TAG_union_type
     377                      .dwattr $C$DW$T$25, DW_AT_name("DACOUTEN_REG")
     378                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     379              $C$DW$30        .dwtag  DW_TAG_member
     380                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     381                      .dwattr $C$DW$30, DW_AT_name("all")
     382                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_all")
     383                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     384                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     385              
     386              $C$DW$31        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$24)
     388                      .dwattr $C$DW$31, DW_AT_name("bit")
     389                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_bit")
     390                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     391                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     392              
     393                      .dwendtag $C$DW$T$25
     394              
     395              
     396              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     397                      .dwattr $C$DW$T$26, DW_AT_name("DACREV_BITS")
     398                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     399              $C$DW$32        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     401                      .dwattr $C$DW$32, DW_AT_name("REV")
     402                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_REV")
     403                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08)
     404                      .dwattr $C$DW$32, DW_AT_bit_size(0x08)
     405                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     406                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     407              
     408              $C$DW$33        .dwtag  DW_TAG_member
     409                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     410                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     411                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     412                      .dwattr $C$DW$33, DW_AT_bit_offset(0x00)
     413                      .dwattr $C$DW$33, DW_AT_bit_size(0x08)
     414                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     416              
     417                      .dwendtag $C$DW$T$26
     418              
     419              
     420              $C$DW$T$27      .dwtag  DW_TAG_union_type
     421                      .dwattr $C$DW$T$27, DW_AT_name("DACREV_REG")
     422                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     423              $C$DW$34        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$34, DW_AT_name("all")
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE    9

     426                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_all")
     427                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     428                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     429              
     430              $C$DW$35        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$26)
     432                      .dwattr $C$DW$35, DW_AT_name("bit")
     433                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_bit")
     434                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     435                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     436              
     437                      .dwendtag $C$DW$T$27
     438              
     439              
     440              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     441                      .dwattr $C$DW$T$28, DW_AT_name("DACTRIM_BITS")
     442                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     443              $C$DW$36        .dwtag  DW_TAG_member
     444                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     445                      .dwattr $C$DW$36, DW_AT_name("OFFSET_TRIM")
     446                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_OFFSET_TRIM")
     447                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08)
     448                      .dwattr $C$DW$36, DW_AT_bit_size(0x08)
     449                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     451              
     452              $C$DW$37        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$37, DW_AT_name("rsvd1")
     455                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd1")
     456                      .dwattr $C$DW$37, DW_AT_bit_offset(0x04)
     457                      .dwattr $C$DW$37, DW_AT_bit_size(0x04)
     458                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     460              
     461              $C$DW$38        .dwtag  DW_TAG_member
     462                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     463                      .dwattr $C$DW$38, DW_AT_name("rsvd2")
     464                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd2")
     465                      .dwattr $C$DW$38, DW_AT_bit_offset(0x00)
     466                      .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     467                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     468                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     469              
     470                      .dwendtag $C$DW$T$28
     471              
     472              
     473              $C$DW$T$29      .dwtag  DW_TAG_union_type
     474                      .dwattr $C$DW$T$29, DW_AT_name("DACTRIM_REG")
     475                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     476              $C$DW$39        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     478                      .dwattr $C$DW$39, DW_AT_name("all")
     479                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_all")
     480                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE   10

     481                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     482              
     483              $C$DW$40        .dwtag  DW_TAG_member
     484                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$28)
     485                      .dwattr $C$DW$40, DW_AT_name("bit")
     486                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_bit")
     487                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     489              
     490                      .dwendtag $C$DW$T$29
     491              
     492              
     493              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     494                      .dwattr $C$DW$T$30, DW_AT_name("DACVALA_BITS")
     495                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     496              $C$DW$41        .dwtag  DW_TAG_member
     497                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     498                      .dwattr $C$DW$41, DW_AT_name("DACVALA")
     499                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_DACVALA")
     500                      .dwattr $C$DW$41, DW_AT_bit_offset(0x04)
     501                      .dwattr $C$DW$41, DW_AT_bit_size(0x0c)
     502                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     504              
     505              $C$DW$42        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     507                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     508                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     509                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00)
     510                      .dwattr $C$DW$42, DW_AT_bit_size(0x04)
     511                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     513              
     514                      .dwendtag $C$DW$T$30
     515              
     516              
     517              $C$DW$T$31      .dwtag  DW_TAG_union_type
     518                      .dwattr $C$DW$T$31, DW_AT_name("DACVALA_REG")
     519                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     520              $C$DW$43        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$43, DW_AT_name("all")
     523                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     524                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     526              
     527              $C$DW$44        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$30)
     529                      .dwattr $C$DW$44, DW_AT_name("bit")
     530                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     531                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     532                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534                      .dwendtag $C$DW$T$31
     535              
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE   11

     536              
     537              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     538                      .dwattr $C$DW$T$32, DW_AT_name("DACVALS_BITS")
     539                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     540              $C$DW$45        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$45, DW_AT_name("DACVALS")
     543                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_DACVALS")
     544                      .dwattr $C$DW$45, DW_AT_bit_offset(0x04)
     545                      .dwattr $C$DW$45, DW_AT_bit_size(0x0c)
     546                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     548              
     549              $C$DW$46        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$46, DW_AT_name("rsvd1")
     552                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd1")
     553                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     554                      .dwattr $C$DW$46, DW_AT_bit_size(0x04)
     555                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     557              
     558                      .dwendtag $C$DW$T$32
     559              
     560              
     561              $C$DW$T$33      .dwtag  DW_TAG_union_type
     562                      .dwattr $C$DW$T$33, DW_AT_name("DACVALS_REG")
     563                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     564              $C$DW$47        .dwtag  DW_TAG_member
     565                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     566                      .dwattr $C$DW$47, DW_AT_name("all")
     567                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
     568                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     570              
     571              $C$DW$48        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$32)
     573                      .dwattr $C$DW$48, DW_AT_name("bit")
     574                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
     575                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     577              
     578                      .dwendtag $C$DW$T$33
     579              
     580              
     581              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     582                      .dwattr $C$DW$T$34, DW_AT_name("DAC_REGS")
     583                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
     584              $C$DW$49        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$27)
     586                      .dwattr $C$DW$49, DW_AT_name("DACREV")
     587                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_DACREV")
     588                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     590              
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE   12

     591              $C$DW$50        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     593                      .dwattr $C$DW$50, DW_AT_name("DACCTL")
     594                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_DACCTL")
     595                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     596                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     597              
     598              $C$DW$51        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$31)
     600                      .dwattr $C$DW$51, DW_AT_name("DACVALA")
     601                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_DACVALA")
     602                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     603                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     604              
     605              $C$DW$52        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$33)
     607                      .dwattr $C$DW$52, DW_AT_name("DACVALS")
     608                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_DACVALS")
     609                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     610                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     611              
     612              $C$DW$53        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$25)
     614                      .dwattr $C$DW$53, DW_AT_name("DACOUTEN")
     615                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_DACOUTEN")
     616                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     617                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     618              
     619              $C$DW$54        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$23)
     621                      .dwattr $C$DW$54, DW_AT_name("DACLOCK")
     622                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_DACLOCK")
     623                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     624                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     625              
     626              $C$DW$55        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$29)
     628                      .dwattr $C$DW$55, DW_AT_name("DACTRIM")
     629                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_DACTRIM")
     630                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     631                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     632              
     633              $C$DW$56        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$56, DW_AT_name("rsvd1")
     636                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd1")
     637                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     638                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     639              
     640                      .dwendtag $C$DW$T$34
     641              
     642              $C$DW$57        .dwtag  DW_TAG_TI_far_type
     643                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$34)
     644              
     645              $C$DW$T$36      .dwtag  DW_TAG_volatile_type
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_Dac.asm                                                      PAGE   13

     646                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$57)
     647              
     648              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
     649                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
     650                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
     651              
     652              
     653              $C$DW$T$38      .dwtag  DW_TAG_array_type
     654                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
     655                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
     656                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
     657              $C$DW$58        .dwtag  DW_TAG_subrange_type
     658                      .dwattr $C$DW$58, DW_AT_upper_bound(0x03)
     659              
     660                      .dwendtag $C$DW$T$38
     661              
     662              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     663                      .dwattr $C$DW$T$2, DW_AT_name("void")
     664              
     665              $C$DW$T$4       .dwtag  DW_TAG_base_type
     666                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     667                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     668                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     669              
     670              $C$DW$T$5       .dwtag  DW_TAG_base_type
     671                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     672                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     673                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     674              
     675              $C$DW$T$6       .dwtag  DW_TAG_base_type
     676                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     677                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     678                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     679              
     680              $C$DW$T$7       .dwtag  DW_TAG_base_type
     681                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     682                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     683                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     684              
     685              $C$DW$T$8       .dwtag  DW_TAG_base_type
     686                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     687                      .dwattr $C$DW$T$8, DW_AT_name("short")
     688                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     689              
     690              $C$DW$T$9       .dwtag  DW_TAG_base_type
     691                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     692                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     693                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     694              
     695              $C$DW$T$10      .dwtag  DW_TAG_base_type
     696                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     697                      .dwattr $C$DW$T$10, DW_AT_name("int")
     698                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     699              
     700              $C$DW$T$11      .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v20.2.0 Tue Sep  7 11:06:10 2021

